lim-cn.org
#+TITLE: GNU Emacs 配置说明
#+AUTHOR: Aaron Liew(aka. tabuyos)
#+EMAIL: tabuyos@outlook.com
#+LANGUAGE: zh-CN
#+OPTIONS: ':t toc:nil num:t author:t email:t
#+STARTUP: content indent align fold
#+PROPERTY: header-args :results silent :noweb yes
#+MACRO: latest-export-date (eval (format-time-string "%F %T %z"))
#+MACRO: word-count (eval (count-words (point-min) (point-max)))

*最新修改于 {{{latest-export-date}}} 共 {{{word-count}}}.*

这是 =Emacs= 的配置文件, 该文件使用 ~babel-tangle~ 技术, 可以自动提取文件中的相关代码, 并将其导出到对应的文件中,
这也被成为 =文学编程=, 可以很好的管理个人配置文件, 同时也可以对其中的配置信息进行阐述/解释

#+TOC: headlines 8 insert TOC here, with eight headline levels

* 概要

我使用 Emacs 进行日常项目的相关开发工作, 包括但不限于: ~Rust~, ~Golang~, ~Java~, ~C/C++~, ~HTML/JavaScript~ 等,
在使用期间, 我始终秉承着一个 =少即是多= 的原则, 尽可能的 =剔除/不添加/不引入= 不必要的 =包/功能=, 将常用的功能进行分类,
不修改原生按键的情况下, 添加更丰富的自定义按键

当前文件是 ~Org~ 文件, 它是生成并控制 ~Emacs~ 所有配置文件的文档, 通过它, 我们可以一边解释某些配置选项的作用, 一边学习新的配置选项,
同时可以将这些配置选项添加到对应的 ~Emacs~ 配置文件中

** 使用环境

- 系统 :: =MacOS=
- 键盘 :: =HHKB= -- 远离 ~RSI(Repetitive strain injury, 即: 重复性劳损)~ 从键盘开始
- 版本 :: =30.0=
- 来源 :: =Source Code=

** 文件解释

- ~early-init.el~ :: 该文件早于处理常规初始化文件, 在软件包系统和 ~GUI~ 初始化之前加载
- ~init.el~ :: 常规初始化文件, 用于加载各种软件包和相关配置
- ~module/~ :: 配置模块目录, 包含 ~Emacs~ 的所有自定义配置信息, 每个模块都涉及特定类型的功能, 主要用于调整相关的软件包
- ~feature/~ :: 自定义库, 用于扩展某些模块

** 必需功能

- UI 界面
- 字体配置
- 近期访问的项目/文件
- 自动保存
- Org-Mode
- 工具集-crux
- 文本相关的操作
  - 注释
  - 光标跳转
  - 文本移动/复制
  - 选取扩展/收缩
  - 多光标操作
- 窗口跳转
- 各种编程语言

* Emacs 的早期初始化(early-init.el)

这是启动期间读取的第一个文件

** 暂存基础信息

 保存一些额外的变量信息, 并将该变量重置, 有助于提升启动速度

#+begin_src emacs-lisp :tangle early-init.el :mkdirp yes
;; (defvar lim--file-name-handler-alist file-name-handler-alist)
;; (defvar lim--vc-handled-backends vc-handled-backends)

;; (setq file-name-handler-alist nil
;;       vc-handled-backends nil)
#+end_src

** 垃圾回收

临时提高垃圾回收的阈值以及堆栈的分配比例, 这有助于提升 ~Emacs~ 的启动速度, 但是请注意, 永久设置该值将是极其危险的, 所以在后续的流程中将重新调整

#+begin_src emacs-lisp :tangle early-init.el :mkdirp yes
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)
#+end_src

** 会话框

调整会话框 ~UI~, 同时将 ~yes-or-no-p~ 替换为 ~y-or-n-p~, 采用更短的应答

#+begin_src emacs-lisp :tangle early-init.el :mkdirp yes
(setq use-file-dialog nil
      use-dialog-box nil
      use-short-answers t)
#+end_src

** 配置基础 UI

在 ~Emacs~ 启动后, 对其基础的 ~UI~ 进行相关的调整, 如:

- 关闭警铃声音
- 关闭 site 相关文件加载
- window/frame 可以进行像素级调整
- frame 标题配置
- 欢迎界面和默认打开 buffer 配置
- 关闭工具栏/菜单栏/滚动条等
- 启动 frame 调整

#+begin_src emacs-lisp :tangle early-init.el :mkdirp yes
(setq ring-bell-function 'ignore
      site-run-file nil)

(setq window-resize-pixelwise t
      frame-resize-pixelwise t)

(setq frame-inhibit-implied-resize t)

(setq frame-title-format
      '((:eval (if (buffer-file-name)
                   (abbreviate-file-name (buffer-file-name))
                 "%b"))))

(setq initial-scratch-message nil
      inhibit-startup-message t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message "Aaron Liew(aka Tabuyos)"
      inhibit-startup-buffer-menu t)

(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))

(when (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1))

(when (fboundp 'menu-bar-mode)
  (menu-bar-mode -1))


;; Option 1: Customize frame size
(add-to-list 'default-frame-alist '(width . (text-pixels . 1500)))
(add-to-list 'default-frame-alist '(height . (text-pixels . 700)))
;; (add-to-list 'default-frame-alist '(undecorated-round . t))
;; (add-to-list 'default-frame-alist '(drag-internal-border . 1))
;; (add-to-list 'default-frame-alist '(internal-border-width . 5))

;; Option 2: Fullscreen
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** 钩子

添加启动后相关恢复配置的钩子, 以及设置基础 frame 的标题

#+begin_src emacs-lisp :tangle early-init.el :mkdirp yes
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 1000 1000 8)
                  gc-cons-percentage 0.1
                  ;; file-name-handler-alist lim--file-name-handler-alist
                  ;; vc-handled-backends lim--vc-handled-backends
                  )))

(add-hook 'after-init-hook (lambda () (set-frame-name "home")))

(provide 'early-init)
#+end_src

* Emacs 的主要初始化(init.el)

** 加载 load-path

- ~lim-loading-paths~ 会递归加载指定目录及其子目录
- ~lim-module-dir~ 为自定义模块目录
- ~lim-feature-dir~ 为自定义库目录
- ~lim-customize-file~ 为个性化配置文件

#+begin_src emacs-lisp :tangle init.el :mkdirp yes
(defun lim-loading-paths (&rest folders)
  (dolist (folder folders)
    (when (file-directory-p folder)
      (let ((parent folder))
        (unless (member parent load-path)
          (add-to-list 'load-path parent))
        (dolist (name (remove ".." (remove "." (directory-files parent))))
          (let ((child (expand-file-name name parent)))
            (when (file-directory-p child)
              (unless (member child load-path)
                (lim-loading-paths child))))))
      )))

(defvar lim-module-dir
  (expand-file-name "module" user-emacs-directory)
  "Lim's initilize directory.")

(defvar lim-feature-dir
  (expand-file-name "feature" user-emacs-directory)
  "Lim's feature directory.")

(defvar lim-customize-file
  (expand-file-name "customizes.el" user-emacs-directory)
  "Lim's customize file.")

(lim-loading-paths lim-module-dir lim-feature-dir)
#+end_src

** 性能分析

#+begin_src emacs-lisp :tangle init.el :mkdirp yes
;; (use-package benchmark-init
;;   :hook
;;   (after-init . benchmark-init/deactivate))

;; (benchmark-init/activate)
#+end_src

** 加载包模块

#+begin_src emacs-lisp :tangle init.el :mkdirp yes
;; Enable module
(require 'lim-module-base)
(require 'lim-module-package)
(require 'lim-module-icon)
(require 'lim-module-appearance)
(require 'lim-module-essential)
(require 'lim-module-hydra)
(require 'lim-module-completion)
(require 'lim-module-dired)
(require 'lim-module-org)
(require 'lim-module-window)
(require 'lim-module-ai)
(require 'lim-module-dev)
(require 'lim-module-keybind)
#+end_src

* Emacs 的配置模块

- info
- package
- icon
- appearance
- essential kill-whole-line 需要调整, cc to mx 应该在特定模式下有效, 需要调整 soothing 的 global
- hydra
- completion
- +search+
- dired
- window
- git
- org
- dev
- web

** lim-module-base.el 模块

*** 用户信息

配置用户相关的基础信息, 这里配置了用户的姓名以及对应的邮箱信息

#+begin_src emacs-lisp :tangle module/lim-module-base.el :mkdirp yes
(eval-and-compile
  (setq user-full-name "Aaron Liew")
  (setq user-mail-address "tabuyos@outlook.com"))
#+end_src

*** 本地编译

检测是否支持原生编译, 并对其进行相关的配置

#+begin_src emacs-lisp :tangle module/lim-module-base.el :mkdirp yes
(use-package emacs
  :config
  (when (native-comp-available-p)
    (setq native-comp-async-report-warnings-errors 'silent)
    (setq native-compile-prune-cache t)))
#+end_src

*** 备份和锁定文件

禁用备份和锁定文件

#+begin_src emacs-lisp :tangle module/lim-module-base.el :mkdirp yes
(use-package emacs
  :config
  (setq create-lockfiles nil)
  (setq make-backup-files nil)
  (setq backup-inhibited nil))
#+end_src

*** 杂项

一些额外的配置, 如 ~alt~ 按键, 光标宽度, 初始 ~*scratch*~ 缓冲区的主模式, 移动文件至 =系统垃圾桶=

#+begin_src emacs-lisp :tangle module/lim-module-base.el :mkdirp yes
(use-package emacs
  :ensure nil
  :config
  (setq x-alt-keysym 'meta)
  (setq x-stretch-cursor nil)
  (setq custom-file lim-customize-file)
  (setq custom-safe-themes t)
  ;; (setq initial-major-mode 'emacs-lisp-mode)
  (setq delete-by-moving-to-trash t))
#+end_src

*** mark 和 kill 环的容量

#+begin_src emacs-lisp :tangle module/lim-module-base.el :mkdirp yes
(use-package emacs
  :ensure nil
  :config
  (setq global-mark-ring-max 200)
  (setq mark-ring-max 200)
  (setq kill-ring-max 200))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-base.el :mkdirp yes
(provide 'lim-module-base)
#+end_src

** lim-module-package.el 模块

*** 加载 lim-package 库

加载自定义 ~package~ 库, 同时开启 ~diminish~, ~straight~, ~quelpa~ 等模块

#+begin_src emacs-lisp :tangle module/lim-module-package.el :mkdirp yes
(use-package lim-package
  :ensure nil
  :config
  (setq package-user-dir archives-dir
        package-archives archives-source
        package-archive-priorities archives-priorities)
  (setq package-install-upgrade-built-in nil)
  (unless (bound-and-true-p package--initialized)
    (setq package-enable-at-startup nil)
    (package-initialize))
  (unless (package-installed-p 'use-package)
    (package-refresh-contents :async)
    (package-install 'use-package))
  (eval-and-compile
    (setq use-package-verbose (not (bound-and-true-p byte-compile-current-file)))
    (setq use-package-always-ensure t)
    (setq use-package-expand-minimally t)
    (setq use-package-compute-statistics t)
    (setq use-package-enable-imenu-support t))

  (integration-diminish)
  ;; (integration-straight)
  ;; (integration-quelpa)
  ;; (integration-elpaca)
  )
#+end_src

*** 加载包管理器

#+begin_src emacs-lisp :tangle module/lim-module-package.el :mkdirp yes
(eval-when-compile
  (require 'use-package)
  (require 'bind-key))
#+end_src

*** 自动更新软件包

#+begin_src emacs-lisp :tangle module/lim-module-package.el :mkdirp yes
(use-package auto-package-update
  :unless (daemonp)
  :custom
  ;; in days
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-delete-old-versions t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-at-time "03:00"))
#+end_src

*** 基础包

#+begin_src emacs-lisp :tangle module/lim-module-package.el :mkdirp yes
(use-package s)

(use-package f)
#+end_src

*** 异步处理

#+begin_src emacs-lisp :tangle module/lim-module-package.el :mkdirp yes
(use-package async
  :config
  (async-bytecomp-package-mode 1))
#+end_src

*** 局部代理

#+begin_src emacs-lisp :tangle module/lim-module-base.el :mkdirp yes
;; (use-package with-proxy)
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-package.el :mkdirp yes
(provide 'lim-module-package)
#+end_src

** lim-module-icon.el 模块

~Emacs~ 中的图标采用 ~nerd-icons~, 其他备选方案有 ~all-the-icons~

*** nerd-icons

#+begin_src emacs-lisp :tangle module/lim-module-icon.el :mkdirp yes
(use-package nerd-icons
  :diminish nil)
#+end_src

*** nerd-icons-completion

#+begin_src emacs-lisp :tangle module/lim-module-icon.el :mkdirp yes
(use-package nerd-icons-completion
  :diminish nil
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (with-eval-after-load 'marginalia
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup)))
#+end_src

*** nerd-icons-corfu

#+begin_src emacs-lisp :tangle module/lim-module-icon.el :mkdirp yes
(use-package nerd-icons-corfu
  :after corfu
  :diminish nil
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src

