lim-cn.org
*** nerd-icons-dired

#+begin_src emacs-lisp :tangle module/lim-module-icon.el :mkdirp yes
(use-package nerd-icons-dired
  :diminish nil
  :hook
  (dired-mode . nerd-icons-dired-mode))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-icon.el :mkdirp yes
(provide 'lim-module-icon)
#+end_src

** lim-module-appearance.el 模块

*** 字体和缩放比例预设

这里预设了可能使用的字体名称, 默认情况下, 中文使用 ~cjk-family~, 符号使用 ~symbol-family~, 表情使用 ~emoji-family~, 英文使用 ~code-family~

#+begin_quote
PS: 为什么不使用 ~default-family~ 字体? 主要是因为该字体在编码环境中行距过窄(字体的 ~ascent~ 和 ~descent~ 过小), 同时穿插着使用中文符号, 而两者的字体高度又不一致, 在输入的过程中会导致画面的抖动(临时调整当前行高导致), 因此为了尽可能的降低二者的影响才使用 ~code-family~ 字体
#+end_quote

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
(defvar emoji-family "Apple Color Emoji" "For emoji in MacOS.")

(defvar emoji-noto-family "NotoEmoji Nerd Font Mono")

(defvar symbol-family "Apple Symbols" "For symbol in MacOS.")

(defvar symbol-noto-family "Symbols Nerd Font Mono")

(defvar cjk-family "PingFang SC" "For CJK font(如汉字) in MacOS.")

(defvar cjk-noto-family "Noto Serif CJK SC")

(defvar kaiti-family "Kaiti SC")

(defvar code-family "JetBrains Mono")

(defvar default-family "Menlo" "For default font(just programing) in MacOS.")

(defvar default-noto-family "NotoMono Nerd Font")

(defvar fixed-family "NotoMono Nerd Font")

(defvar fixed-serif-family "NotoSerif Nerd Font Mono")

(defvar variable-family "NotoSans Nerd Font")

(defvar cjk-rescale-ratio 0.85)
#+end_src

*** CJK, Emoji 和 Symbol

设置 =CJK=, =Emoji= 和 =Symbol= 使用的字体, 通过设置 ~use-default-font-for-symbols~ 为 ~nil~ 以禁止使用默认字体来渲染符号, 从而使用指定字体来渲染

- Option 1(推荐) :: 通过调整 ~CJK~ 字体的缩放比例, 从而使中英文字体高度一致(缺点: 中文字体看上去会显得较小)
- Option 2 :: 通过控制 ~line-height~ 从而兼容所有字体高度(缺点: 单屏所容纳的内容较少)

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
(defun lim--rescale-font (family ratio)
  (if (/= ratio 0.0)
      (let ((elt (cons family ratio)))
        (unless (member elt face-font-rescale-alist)
          (push elt face-font-rescale-alist)))))

(defun lim--make-consistent-height (family)
  (let* ((font (face-attribute 'default :font))
         (size (font-get font :size))
         (name (format "%s-%s" family size))
         (height (aref (font-info name) 3))
         (modify (< (default-line-height) height)))
    (if modify
        (setq-default default-text-properties (list 'line-height height))
      )))

(defun lim-set-other-fontset-font ()
  (when window-system
    (setq use-default-font-for-symbols nil)

    (set-fontset-font t 'emoji (font-spec :family emoji-family))
    (set-fontset-font t 'symbol (font-spec :family symbol-family))

    (let* ((fontset (frame-parameter nil 'font))
           (ratio (or cjk-rescale-ratio 0.0))
           (family cjk-family)
           ;; (family cjk-noto-family)
           (fontspec (font-spec :family family)))

      (dolist (charset '(kana han hangul cjk-misc bopomofo))
        (set-fontset-font fontset charset fontspec))

      ;; Option 1
      (lim--rescale-font cjk-family ratio)

      ;; Option 2
      ;; (lim--make-consistent-height family)
      )))
#+end_src

*** 主题

 加载两种主题软件包, 高对比度: ~modus-themes~, 多色彩: ~ef-themes~, 这两个软件包都提供了丰富的主题以供选择, 方法 ~lim/apply-theme~ 会自动根据当前系统的主题模式(=light= or =dark=)加载对应的主题

#+begin_quote
在亮模式下使用 ~ef-day~, 暗模式下则使用 ~ef-elea-dark~, 方法 ~ef-themes-load-random~ 会随机加载特定模式下的主题
#+end_quote

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
;;; modus themes
(use-package modus-themes
  :demand t)

;; ef themes
(use-package ef-themes
  :demand t
  :config
  (setq ef-themes-variable-pitch-ui t)
  (setq ef-themes-mixed-fonts t)

  (defun lim/apply-theme (appearance)
    "Load theme, taking current system APPEARANCE into consideration."
    (mapc #'disable-theme custom-enabled-themes)
    (pcase appearance
      ('light (load-theme 'ef-day t))
      ('dark (load-theme 'ef-elea-dark t))))
  ;; (ef-themes-load-random 'dark)
  ;; (load-theme 'ef-day t)
  (add-hook 'ns-system-appearance-change-functions #'lim/apply-theme)
  )
#+end_src

*** 突出显示当前行

调用某些函数后, 可以短暂的突出显示当前行, 这些函数定义在 ~pulsar-pulse-functions~

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
(use-package pulsar
  :hook
  ((next-error . (pulsar-pulse-line-red pulsar-recenter-top pulsar-reveal-entry))
   (minibuffer-setup . pulsar-pulse-line-red))
  :bind
  (("C-x l" . pulsar-pulse-line))
  :config
  (setopt pulsar-pulse t
          pulsar-delay 0.055
          pulsar-iterations 10
          pulsar-face 'pulsar-magenta
          pulsar-highlight-face 'pulsar-cyan)

  (pulsar-global-mode 1))
#+end_src

*** 高亮当前行

使用 ~lin-mode~ 来开启高亮当前行, 即增强 ~hl-line-mode~, 设置 ~hl-line~ 的样式为 ~lin~ 指的样式

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
;; (use-package lin
;;   :hook
;;   (after-init . lin-global-mode)
;;   ((prog-mode text-mode) . lin-mode)
;;   :config
;;   (setq lin-face 'lin-green))
#+end_src

使用原生高亮当前行

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
(use-package hl-line
  :ensure nil
  :functions (lim/set-cursor-fringe lim/cursor-fringe-local-buffer-run)
  :hook ((prog-mode text-mode) . lim/cursor-fringe-local-buffer-run)
  :config
  (defface lim/cursor-left-fringe-face
    '((t (:foreground "firebrick")))
    "Face for `lim/cursor-left-fringe-face'.")

  (defvar-local lim/cursor-left-fringe-overlay-position nil
    "Store cursor's position.

`overlay-arrow-bitmap' is a special SYMBOL defined in xdisp.c.")

  (defun lim/set-cursor-fringe ()
    "Set current cursor fringe."
    (if (not (and (eobp) (bolp)))
        (setq lim/cursor-left-fringe-overlay-position (copy-marker (line-beginning-position)))
      (setq lim/cursor-left-fringe-overlay-position  nil)))

  (defun lim/cursor-fringe-local-buffer-run ()
    "Registry fn to prog mode."
    (add-hook 'post-command-hook 'lim/set-cursor-fringe 'append 'local))

  ;; (define-fringe-bitmap 'lim/cursor-left-fringe-bitmap [128 192 96 48 24 48 96 192 128] 9 8 'center)
  (define-fringe-bitmap 'lim/cursor-left-fringe-bitmap [192 96 48 24 12 24 48 96 192] 9 8 'center)

  (set-fringe-bitmap-face 'lim/cursor-left-fringe-bitmap 'lim/cursor-left-fringe-face)

  (add-to-list 'overlay-arrow-variable-list 'lim/cursor-left-fringe-overlay-position)

  (put 'lim/cursor-left-fringe-overlay-position 'overlay-arrow-bitmap 'lim/cursor-left-fringe-bitmap))
#+end_src

*** window/frame 的间距/填充

这里设定了一些默认的 =UI= 部分的间距/填充, 特别需要注意的是: ~mode-line-active~ 是指当前激活窗口的 ~mode-line~, 同理, ~mode-line-inactive~ 是其他未激活窗口的 ~mode-line~

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
(use-package spacious-padding
  :if (display-graphic-p)
  :hook (after-init . spacious-padding-mode)
  :init
  (setq spacious-padding-widths
        '( :internal-border-width 15
           :header-line-width 4
           :mode-line-width 6
           :tab-width 4
           :right-divider-width 1
           :scroll-bar-width 8
           :left-fringe-width 20
           :right-fringe-width 20))
  (setq spacious-padding-subtle-mode-line
        '( :mode-line-active help-key-binding
           :mode-line-inactive window-divider))
  )
#+end_src

*** 渲染 buffer 中的颜色值

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
(use-package colorful-mode
  :diminish
  :hook (after-init . global-colorful-mode)
  :init
  (setq colorful-use-prefix t
        colorful-prefix-string "⬤")
  (setq colorful-allow-mouse-clicks nil)
  (dolist (mode '(html-mode help-mode helpful-mode))
    (add-to-list 'global-colorful-modes mode)))

;; (use-package rainbow-mode
;;   :diminish
;;   :commands rainbow-mode
;;   :init
;;   (setq rainbow-ansi-colors nil)
;;   (setq rainbow-x-colors nil)
;;   :hook (prog-mode . rainbow-mode))
#+end_src

*** 彩虹括号

#+begin_src emacs-lisp :tangle module/lim-module-appearance.el :mkdirp yes
(use-package rainbow-delimiters
  :commands rainbow-delimiters-mode
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

