module/lim-module-appearance.el

(use-package cursory
  :demand t
  ;; :if (display-graphic-p)
  :config
  (setq cursory-presets
        '((box
           :blink-cursor-interval 0.8)
          (box-no-blink
           :blink-cursor-mode -1)
          (bar
           :cursor-type (bar . 2)
           :blink-cursor-interval 0.8)
          (bar-no-other-window
           :inherit bar
           :cursor-in-non-selected-windows nil)
          (bar-no-blink
           :cursor-type (bar . 2)
           :blink-cursor-mode -1)
          (underscore
           :cursor-type (hbar . 3)
           :blink-cursor-blinks 50)
          (underscore-thin-other-window
           :inherit underscore
           :cursor-in-non-selected-windows (hbar . 1))
          (underscore-thick
           :cursor-type (hbar . 8)
           :blink-cursor-interval 0.3
           :blink-cursor-blinks 50
           :cursor-in-non-selected-windows (hbar . 3))
          (underscore-thick-no-blink
           :blink-cursor-mode -1
           :cursor-type (hbar . 8)
           :cursor-in-non-selected-windows (hbar . 3))
          (t
           :cursor-type box
           :cursor-in-non-selected-windows hollow
           :blink-cursor-mode 1
           :blink-cursor-blinks 10
           :blink-cursor-interval 0.2
           :blink-cursor-delay 0.2)))
  (cursory-set-preset (or (cursory-restore-latest-preset) 'box))
  :hook
  (kill-emacs . cursory-store-latest-preset))

(use-package fontaine
  ;; :if (display-graphic-p)
  :init
  :hook
  ((after-init . fontaine-mode)
   (after-init . (lambda ()
                   (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))))
   (fontaine-set-preset . lim-set-other-fontset-font))
  :config
  (setq text-scale-mode-step 1.172)
  (setq x-underline-at-descent-line nil)
  (setq-default text-scale-remap-header-line t)
  (setq fontaine-latest-state-file (locate-user-emacs-file "fontaine-latest-state.eld"))

  (setq fontaine-presets
        `((small
           :default-height 140)
          (regular) ;; use fallback values
          (medium
           :default-weight semilight
           :default-height 170
           :bold-weight extrabold)
          (large
           :inherit medium
           :default-height 180)
          (presentation
           :default-height 190)
          (t
           :default-family ,code-family
           :default-weight regular
           :default-height 160
           :fixed-pitch-family ,fixed-family
           :fixed-pitch-weight nil
           :fixed-pitch-height 1.0
           :fixed-pitch-serif-family ,fixed-serif-family
           :fixed-pitch-serif-weight nil
           :fixed-pitch-serif-height 1.0
           :variable-pitch-family ,variable-family
           :variable-pitch-weight nil
           :variable-pitch-height 1.0
           :line-spacing nil)))

  (with-eval-after-load 'pulsar
    (add-hook 'fontaine-set-preset-hook #'pulsar-pulse-line)))

(use-package lim-modeline
  :ensure nil
  :config
  (require 'project)

  (setq mode-line-compact nil)
  (setq mode-line-right-align-edge 'right-margin)
  (setq-default mode-line-format
                '("%e"
                  lim-modeline-window-number
                  lim-modeline-buffer-status
                  lim-modeline-hydra
                  lim-modeline-kbd-macro
                  lim-modeline-narrow
                  lim-modeline-remote-status
                  lim-modeline-window-dedicated-status
                  lim-modeline-input-method
                  lim-modeline-major-mode
                  lim-modeline-minor-mode
                  lim-modeline-cursor-position
                  lim-modeline-selection
                  lim-modeline-encoding
                  lim-modeline-buffer-id-with-breadcrumb
                  lim-modeline-process
                  lim-modeline-vc
                  lim-modeline-eglot
                  ;; lim-modeline-notmuch-indicator
                  mode-line-format-right-align
                  lim-modeline-flymake
                  ;; project-mode-line-format
                  lim-modeline-misc-info
                  )))

;; (use-package keycast
;;   :after lim-modeline
;;   :commands (keycast-mode-line-mode keycast-header-line-mode keycast-tab-bar-mode keycast-log-mode)
;;   :init
;;   (setq keycast-mode-line-format "%2s(%K%1s%c%R)")
;;   (setq keycast-mode-line-insert-after 'lim-modeline-misc-info)
;;   (setq keycast-mode-line-window-predicate 'mode-line-window-selected-p)
;;   (setq keycast-mode-line-remove-tail-elements nil)
;;   :config
;;   (dolist (input '(self-insert-command org-self-insert-command))
;;     (add-to-list 'keycast-substitute-alist `(,input "." "Typing…")))

;;   (dolist (event '( mouse-event-p mouse-movement-p mwheel-scroll handle-select-window
;;                     mouse-set-point mouse-drag-region))
;;     (add-to-list 'keycast-substitute-alist `(,event nil))))

(use-package emacs
  :config
  (setq-default indicate-buffer-boundaries 'left))

(use-package breadcrumb
  :hook (after-init . breadcrumb-mode)
  :config
  (setq breadcrumb-project-max-length 0.5)
  (setq breadcrumb-project-crumb-separator "/")
  (setq breadcrumb-imenu-max-length 1.0)
  (setq breadcrumb-imenu-crumb-separator " > "))

(use-package hl-todo
  :hook (prog-mode . hl-todo-mode)
  :config
  (setq hl-todo-highlight-punctuation ":")
  (setq hl-todo-keyword-faces
        `(("TODO"       warning bold)
          ("FIXME"      error bold)
          ("HACK"       font-lock-constant-face bold)
          ("REVIEW"     font-lock-keyword-face bold)
          ("NOTE"       success bold)
          ("DEPRECATED" font-lock-doc-face bold))))

(use-package minimap
  :defer t
  :config
  (setq minimap-window-location 'right)
  (setq minimap-update-delay 0)
  (setq minimap-width-fraction 0.09)
  (setq minimap-minimum-width 15))

(use-package page-break-lines
  :diminish
  ;; :hook (after-init . global-page-break-lines-mode)
  )

(provide 'lim-module-appearance)
