module/lim-module-essential.el
(use-package emacs
  :ensure nil
  :config
  (setq mode-require-final-newline 'visit-save)
  (global-display-line-numbers-mode)
  (column-number-mode)
  (line-number-mode))

(use-package autorevert
  :ensure nil
  :config
  (setq auto-revert-verbose t)
  (global-auto-revert-mode))

(use-package emacs
  :ensure nil
  :demand t
  :config
  (setq tab-always-indent 'complete)
  (setq tab-first-completion 'word-or-paren-or-punct)
  (setq-default tab-width 2
                standard-indent 2
                indent-tabs-mode nil
                c-basic-offset 2))

(use-package emacs
  :config
  (global-set-key (kbd "C-<down-mouse-1>") 'ignore)
  (global-set-key [mode-line mouse-1] 'ignore)
  (global-set-key [mode-line mouse-2] 'ignore)
  (global-set-key [mode-line mouse-3] 'ignore))

(use-package mouse
  :ensure nil
  :hook (after-init . mouse-wheel-mode)
  :config
  (setq mouse-wheel-tilt-scroll t)
  (setq mouse-wheel-flip-direction t)
  (setq-default scroll-conservatively 1 ; affects `scroll-step'
                ;; scroll-preserve-screen-position 1 ; don't move when scroll
                scroll-margin 0
                next-screen-context-lines 0))
