lim-cn.org
*** 保存光标位置

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package saveplace
  :ensure nil
  :config
  (setq save-place-forget-unreadable-files nil)
  :hook (after-init . save-place-mode))
#+end_src

*** 括号高亮和补全

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package paren
  :ensure nil
  :hook (after-init . show-paren-mode)
  :config
  (setq show-paren-style 'parenthesis)
  (setq show-paren-when-point-in-periphery t)
  (setq show-paren-when-point-inside-paren t)
  (setq show-paren-context-when-offscreen 'overlay))

(use-package electric
  :ensure nil
  :hook
  (prog-mode . electric-indent-local-mode))

(use-package elec-pair
  :ensure nil
  :hook (after-init . electric-pair-mode)
  ;; :init
  ;; (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit)
  )
#+end_src

*** 选区和删除

选择选区后可以直接进行删除

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package delsel
  :ensure nil
  :hook (after-init . delete-selection-mode))
#+end_src

*** 窗口/符号跳转

双眼所至, 光标所达

=ace-window= 在仅有两个窗口时进行切换则直接跳转到另一个窗口, 多于两个窗口时, 则在对应窗口左上角高亮窗口序号, 按对应序号直接跳转

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package avy
  :config
  (setq avy-background t)
  (setq avy-all-windows t)
  (setq avy-timeout-seconds 0.3))

(use-package ace-window
  :defer t
  :config
  (set-face-attribute 'aw-leading-char-face nil :height 1.0))
#+end_src

*** 符号高亮

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package symbol-overlay
  :diminish
  :custom-face
  (symbol-overlay-default-face ((t :inherit (bold shadow) :underline (:color "gray"))))
  (symbol-overlay-face-1 ((t (:inherit nerd-icons-blue :background unspecified :foreground unspecified :inverse-video t))))
  (symbol-overlay-face-2 ((t (:inherit nerd-icons-pink :background unspecified :foreground unspecified :inverse-video t))))
  (symbol-overlay-face-3 ((t (:inherit nerd-icons-yellow :background unspecified :foreground unspecified :inverse-video t))))
  (symbol-overlay-face-4 ((t (:inherit nerd-icons-purple :background unspecified :foreground unspecified :inverse-video t))))
  (symbol-overlay-face-5 ((t (:inherit nerd-icons-red :background unspecified :foreground unspecified :inverse-video t))))
  (symbol-overlay-face-6 ((t (:inherit nerd-icons-orange :background unspecified :foreground unspecified :inverse-video t))))
  (symbol-overlay-face-7 ((t (:inherit nerd-icons-green :background unspecified :foreground unspecified :inverse-video t))))
  (symbol-overlay-face-8 ((t (:inherit nerd-icons-cyan :background unspecified :foreground unspecified :inverse-video t))))
  :hook ((prog-mode . symbol-overlay-mode))
  :init (setq symbol-overlay-idle-time 0.3))
#+end_src

*** 帮助文档自动跳转

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package help
  :ensure nil
  :config
  (setq help-window-select t))
#+end_src

*** 文本操作工具

- =move-dup= :: 文本移动和重复
- =crux= :: 各种小工具
- =expreg= :: 选区扩展/收缩
- =multiple-cursors= :: 多光标

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package move-dup)

(use-package crux)

(use-package expreg)

(use-package multiple-cursors
  :config
  (setq mc/always-run-for-all t))
#+end_src

*** 代码折叠

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package hideshow
  :diminish hs-minor-mode
  :hook (prog-mode . hs-minor-mode))
#+end_src

*** 自动保存

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package super-save
  :diminish nil
  :config
  (super-save-mode)
  (setq super-save-auto-save-when-idle t))
#+end_src

*** 加载 lim-helper 库

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package lim-helper
  :ensure nil
  :functions (lim-helper-truncate-lines-silently)
  :hook ((fundamental-mode text-mode prog-mode) . lim-helper-truncate-lines-silently)
  :config
  (advice-add #'execute-extended-command--describe-binding-msg :override #'lim-helper-ignore))
#+end_src

*** 格式化

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package format-all
  :defer t
  :diminish nil
  :commands format-all-mode
  ;; :hook (prog-mode . format-all-mode)
  :bind ("C-c f" . #'format-all-region-or-buffer))
#+end_src

*** Compilation 缓冲区彩色化

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package compile
  :ensure nil
  :functions (lim/compilation-colorize-buffer)
  :hook (compilation-filter . lim/compilation-colorize-buffer)
  :config
  (require 'lim-simple)
  (setq compilation-buffer-name-function #'lim-simple-compilation-buffer-name)
  (require 'ansi-color)
  (defun lim/compilation-colorize-buffer ()
    (let ((buffer-read-only nil))
      (ansi-color-apply-on-region compilation-filter-start (point)))))
#+end_src

*** 加载环境变量

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package exec-path-from-shell
  ;; :autoload (exec-path-from-shell-initialize)
  :config (exec-path-from-shell-initialize))
#+end_src

*** 加载 lim-simple 库

该库增强了 ~simple.el~ (=Emacs= 内置)并添加了某些自定义函数

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package lim-simple
  :ensure nil)
#+end_src

*** 加载 lim-scratch 库

为所有的 ~major-mode~ 创建 ~scratch buffer~, 默认当前的 =buffer= 的 ~major-mode~

如果标记了选区, 那么同时还会将该选区的内容一并发送至该 ~scratch buffer~

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package lim-scratch
  :ensure nil
  :bind
  ("C-c s" . lim-scratch-buffer))
#+end_src

*** 持久化 scratch

重置某些冲突的按键

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package elisp-mode
  :ensure nil
  :bind
  ( :map lisp-interaction-mode-map
    ("C-j" . nil)
    ("M-RET" . eval-print-last-sexp)))
#+end_src

持久化

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package persistent-scratch
  :diminish
  :bind (:map persistent-scratch-mode-map
         ([remap kill-buffer] . lim-scratch-confirm-kill-buffer)
         ([remap revert-buffer] . persistent-scratch-restore)
         ([remap revert-this-buffer] . persistent-scratch-restore))
  :hook ((after-init . persistent-scratch-autosave-mode)
         (lisp-interaction-mode . persistent-scratch-mode))
  :init (setq persistent-scratch-backup-file-name-format "%Y-%m-%d"
              persistent-scratch-backup-directory
              (expand-file-name "persistent-scratch" user-emacs-directory)))
#+end_src

*** 加载 lim-pair 库

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package lim-pair :ensure nil)
#+end_src

*** 近期访问文件

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package recentf
  :ensure nil
  :hook (after-init . recentf-mode)
  :config
  (setq recentf-auto-cleanup 'never)
  (setq recentf-max-saved-items 200)
  (setq recentf-max-menu-items 100)
  (setq recentf-exclude `(,(recentf-expand-file-name "\\(straight\\|quelpa\\|elpa\\|eln-cache\\|var\\|.cache\\)/.*")
                          ,(recentf-expand-file-name "\\(auto-save-list\\|temp\\|transient\\|etc\\|backup\\|elfeed\\)/.*")
                          ,(recentf-expand-file-name "\\(recentf\\|bookmarks\\|savehist\\|places\\)")
                          ,tramp-file-name-regexp
                          "^/tmp" "\\.bak\\'" "\\.gpg\\'" "\\.gz\\'" "\\.tgz\\'" "\\.xz\\'" "\\.zip\\'" "^/ssh:" "\\.png\\'"
                          "\\.jpg\\'" "/\\.git/" "\\.gitignore\\'" "\\.log\\'" "COMMIT_EDITMSG" "\\.pyi\\'" "\\.pyc\\'"
                          ))

  ;; (run-at-time nil (* 5 60) #'recentf-save-list)
  (add-hook 'kill-emacs-hook #'recentf-save-list)
  ;; (add-hook 'kill-emacs-hook #'recentf-cleanup)
  )
#+end_src

*** 书签(Bookmark)

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package bookmark
  :ensure nil
  :commands (bookmark-set bookmark-jump bookmark-bmenu-list)
  :hook (bookmark-bmenu-mode . hl-line-mode))
#+end_src

*** 注册表(Register)

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package register
  :ensure nil
  :defer t
  :config
  (setq register-preview-delay 0.8
        register-preview-function #'register-preview-default)

  (with-eval-after-load 'savehist
    (add-to-list 'savehist-additional-variables 'register-alist)))
#+end_src

*** 工具提示

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package tooltip
  :ensure nil
  :hook (after-init . tooltip-mode)
  :config
  (setq tooltip-delay 0.5
        tooltip-short-delay 0.5
        x-gtk-use-system-tooltips t
        tooltip-frame-parameters
        '((name . "tooltip")
          (internal-border-width . 10)
          (border-width . 0)
          (no-special-glyphs . t))))
#+end_src

*** Emacs 服务器

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package server
  :ensure nil
  :defer 1
  :config
  (setq server-client-instructions nil)
  (unless (server-running-p)
    (server-start)))
#+end_src

*** 改动跳转

#+begin_src emacs-lisp :tangle module/lim-module-essential.el :mkdirp yes
(use-package goto-chg
  :bind
  (("C-(" . goto-last-change)
   ("C-)" . goto-last-change-reverse)))
#+end_src

