module/lim-module-essential.el

(use-package view
  :ensure nil
  :functions (readonly-if-internal)
  :hook
  (emacs-lisp-mode . readonly-if-internal)
  (find-function-after . view-mode)
  (find-file . view-mode)
  :config
  (setcdr view-mode-map nil)
  (defun readonly-if-internal ()
    (let ((name (or (buffer-file-name) "")))
      (cond
       ((string-match "\\.el\\.gz\\'" name) (read-only-mode +1))
       ((string-match "\\*/elpa" name) (read-only-mode +1)))))
  )

(use-package winner-mode
  :ensure nil
  :hook (after-init . winner-mode))

(use-package ediff
  :ensure nil
  :hook (ediff-quit . winner-undo))

(use-package so-long
  :ensure nil
  :config (global-so-long-mode 1))

(use-package vundo
  :defer 1
  :bind
  (("C-c C-/" . vundo)
   :map vundo-mode-map
   ("C-/" . vundo-backward)
   ("b" . vundo-backward)
   ("f" . vundo-forward)
   ("g" . vundo-goto-last-saved)
   ("h" . vundo-backward)
   ("j" . vundo-next)
   ("k" . vundo-previous)
   ("l" . vundo-forward))
  :config
  (setq vundo-compact-display t)
  
  (with-eval-after-load 'pulsar
    (add-hook 'vundo-post-exit-hook #'pulsar-pulse-line-green)))

(use-package lim-search
  :ensure nil
  :commands (lim-search-mode lim-search-mode-toggle)
  :hook
  (lim-search-mode-quit . lim-search-dehighlight)
  ;; (lim-search-mode-quit . (lambda () (lazy-highlight-cleanup t)))
  ;; (lim-search-mode . isearch-exit)
  )

(use-package isearch
  :ensure nil
  :demand t
  :hook
  (isearch-mode-end . lim-search-dehighlight)
  :bind
  ( :map isearch-mode-map
    ([remap isearch-delete-char] . #'isearch-del-char)
    ([escape] . #'isearch-exit)
    ("C-c C-c" . #'lim-search-mode)
    )
  :config
  (setq isearch-lazy-count t)
  (setq lazy-count-prefix-format "(%s/%s) ")
  (setq lazy-count-suffix-format nil)
  (setq lazy-highlight-cleanup nil))

(use-package uniquify
  :ensure nil
  :config
  (setq uniquify-buffer-name-style 'forward
        uniquify-separator "/"
        ;; frename buffer after killing uniquify
        uniquify-after-kill-buffer-p t
        ;; don't mock special buffers
        uniquify-ignore-buffers-re "^\\*"
        ))

(use-package dumb-jump
  :hook
  (xref-backend-functions . dumb-jump-xref-activate)
  :init
  ;; (setq dumb-jump-default-project user-emacs-directory)
  (setq dumb-jump-selector 'completing-read))

(use-package simple
  :ensure nil
  :config
  (setq-default fill-column 120))

(use-package popper
  :hook
  (after-init . popper-mode)
  (popper-mode-hook . popper-echo-mode)
  ;; :config
  ;; (setq popper-reference-buffers
  ;;       '("\\*Messages\\*"
  ;;         "^\\*eldoc"
  ;;         elisp-refs-mode
  ;;         flymake-diagnostics-buffer-mode
  ;;         (lambda (buf)
  ;;           (with-current-buffer buf
  ;;             (derived-mode-p
  ;;              '(compilation-mode
  ;;                comint-mode
  ;;                help-mode))))))
  )

(use-package shackle
  :config
  (setq popper-display-control nil)
  ;; (setq split-width-threshold 1)
  (setq shackle-default-rule '(:select t))
  (setq shackle-rules
      '((help-mode :select t :align right)
        (compilation-mode :select t :size 0.3 :align below)))
  (shackle-mode 1))

(use-package whitespace
  :ensure nil
  :diminish nil
  ;; :hook ((prog-mode markdown-mode conf-mode) . whitespace-mode)
  :config
  (setq whitespace-line-column nil)
  (setq whitespace-style
        '(face
          trailing
          lines-tail
          tabs
          tab-mark
          missing-newline-at-eof
          ))
  (global-whitespace-mode))

(use-package repeat
  :ensure nil
  ;; :hook (after-init . repeat-mode)
  :config
  (setq repeat-exit-key "<escape>"))

(use-package defrepeater
  :vc ( :url "https://github.com/alphapapa/defrepeater.el.git"
        :rev :newest))

(use-package anzu)

(use-package flymake
  :diminish
  ;; :bind ("C-c f" . flymake-show-buffer-diagnostics)
  :hook (prog-mode . flymake-mode)
  :init
  (setq flymake-no-changes-timeout nil)
  (setq flymake-fringe-indicator-position 'right-fringe))

(use-package sideline-flymake
  :diminish sideline-mode
  :custom-face
  (sideline-flymake-error ((t (:height 0.85 :italic t))))
  (sideline-flymake-warning ((t (:height 0.85 :italic t))))
  (sideline-flymake-success ((t (:height 0.85 :italic t))))
  :hook (flymake-mode . sideline-mode)
  :init
  (setq sideline-flymake-display-mode 'point)
  (setq sideline-backends-right '(sideline-flymake)))

(use-package newcomment
  :ensure nil
  :config
  (setq comment-empty-lines nil))

(use-package lim-soothing
  :ensure nil
  :hook (after-init . global-lim-soothing-mode)
  :bind
  ( :map lim-soothing-mode-map

    ;; comment
    ("M-;" . lim-soothing-comment)
    ("C-c M-;" . lim-soothing-comment-timestamp-keyword)

    ;; jump
    ("C-;" . avy-goto-char-timer)
    ("C-c C-j" . avy-resume)

    ;; move/duplicate
    ("M-p" . move-dup-move-lines-up)
    ("M-n" . move-dup-move-lines-down)
    ;; ("C-c C-d" . move-dup-duplicate-down)
    ("C-c C-d" . lim-simple-duplicate-line-or-region)
    ("C-c C-u" . move-dup-duplicate-up)

    ;; expreg
    ("C-M-w" . expreg-expand)
    ("C-M-s" . expreg-contract)

    ;; crux
    ("C-a" . crux-move-beginning-of-line)
    ("C-c C-k" . lim-simple-kill-whole-line-or-region)
    ("C-S-j" . crux-top-join-line)
    ("C-j" . crux-smart-open-line)
    ("C-o" . crux-smart-open-line-above)

    ;; multiple-cursor
    ("C-c m t" . mc/mark-all-like-this)
    ("C-c m m" . mc/mark-all-like-this-dwim)
    ("C-c m l" . mc/edit-lines)
    ("C-c m e" . mc/edit-ends-of-lines)
    ("C-c m a" . mc/edit-beginnings-of-lines)
    ("C-c m n" . mc/mark-next-like-this)
    ("C-c m p" . mc/mark-previous-like-this)
    ("C-c m s" . mc/mark-sgml-tag-pair)
    ("C-c m d" . mc/mark-all-like-this-in-defun)

    ;; ace window
    ([remap other-window] . ace-window)

    ;; fold
    ("C-." . hs-toggle-hiding)
    ))

(provide 'lim-module-essential)
