module/lim-module-completion.el
(defun lim-orderless--consult-suffix ()
  "Regexp which matches the end of string with Consult tofu support."
  (if (and (boundp 'consult--tofu-char) (boundp 'consult--tofu-range))
      (format "[%c-%c]*$"
              consult--tofu-char
              (+ consult--tofu-char consult--tofu-range -1))
    "$"))

(defun lim-orderless-literal (word _index _total)
  "Read WORD= as a literal string."
  (when (string-suffix-p "=" word)
    ;; The `orderless-literal' is how this should be treated by
    ;; orderless.  The `substring' form omits the `=' from the
    ;; pattern.
    `(orderless-literal . ,(substring word 0 -1))))

(defun lim-orderless-consult-dispatch (word _index _total)
  (cond
   ;; Ensure that $ works with Consult commands, which add disambiguation suffixes
   ((string-suffix-p "$" word)
    `(orderless-regexp . ,(concat (substring word 0 -1) (lim-orderless--consult-suffix))))
   ;; File extensions
   ((and (or minibuffer-completing-file-name
             (derived-mode-p 'eshell-mode))
         (string-match-p "\\`\\.." word))
    `(orderless-regexp . ,(concat "\\." (substring word 1) (lim-orderless--consult-suffix))))))

(defun lim-orderless-beg-or-end (word _index _total)
  "Expand WORD~ to \\(^WORD\\|WORD$\\)."
  (when-let (((string-suffix-p "~" word))
             (word (substring word 0 -1)))
    `(orderless-regexp . ,(format "\\(^%s\\|%s$\\)" word word))))

(defun lim-orderless-dispatch-flex-first (_pattern index _total)
    (and (eq index 0) 'orderless-flex))

(use-package vertico
  :init
  (vertico-mode)
  :config
  (setq vertico-cycle t)
  (setq vertico-resize t))

(use-package vertico-directory
  :after vertico
  :ensure nil
  :bind
  ( :map vertico-map
    ("RET" . vertico-directory-enter)
    ("DEL" . vertico-directory-delete-char)
    ("M-DEL" . vertico-directory-delete-word))
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package emacs
  :init
  (defun lim/crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'lim/crm-indicator))

(use-package marginalia
  :defer 1
  :bind
  ( :map minibuffer-local-map
    ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode)
  :config
  (setq marginalia-max-relative-age 0))

(use-package orderless
  :demand t
  :after minibuffer
  :bind ( :map minibuffer-local-completion-map
          ("SPC" . nil)
          ("?" . nil))
  :config
  (orderless-define-completion-style +orderless-with-initialism
    (orderless-matching-styles '(orderless-initialism orderless-literal orderless-regexp)))

  (setq orderless-matching-styles '(orderless-prefixes orderless-literal orderless-regexp))

  (setq orderless-style-dispatchers
        '(lim-orderless-literal
          lim-orderless-beg-or-end
          lim-orderless-consult-dispatch
          orderless-affix-dispatch))

  (setq orderless-component-separator #'orderless-escapable-split-on-space)

  ;; (setq completion-styles '(substring initials flex orderless basic))
  (setq completion-styles '(substring partial-completion initials flex orderless basic))
  (setq completion-category-defaults nil)
  (setq completion-category-overrides
        '((file (styles . (partial-completion orderless basic)))
          (bookmark (styles . (orderless basic)))
          (library (styles . (orderless basic)))
          (lsp-capf (styles . (orderless basic)))
          (embark-keybinding (styles . (substring orderless basic)))
          (imenu (styles . (substring orderless basic)))
          (consult-location (styles . (substring orderless basic)))
          (kill-ring (styles . (substring orderless basic)))
          (eglot (styles . (substring orderless basic)))
          (eglot-capf (styles . (substring orderless basic)))
          (command (styles +orderless-with-initialism))
          (variable (styles +orderless-with-initialism))
          (symbol (styles +orderless-with-initialism)))))

(use-package emacs
  :config
  (setq completion-ignore-case t)
  (setq read-buffer-completion-ignore-case t)
  (setq-default case-fold-search t)
  (setq read-file-name-completion-ignore-case t))

(use-package mb-depth
  :ensure nil
  :hook
  ((after-init . minibuffer-depth-indicate-mode)
   (minibuffer-setup . cursor-intangible-mode))
  :config
  (setq minibuffer-prompt-properties '(read-only t cursor-intangible t face minibuffer-prompt))
  (setq read-extended-command-predicate #'command-completion-default-include-p)
  (setq read-minibuffer-restore-windows nil)
  (setq enable-recursive-minibuffers t))

(use-package minibuf-eldef
  :ensure nil
  :hook (after-init . minibuffer-electric-default-mode)
  :config
  (setq minibuffer-default-prompt-format " [%s]"))

(use-package rfn-eshadow
  :ensure nil
  :config
  (setq resize-mini-windows t)
  (setq read-answer-short t)
  (setq echo-keystrokes 0.25)
  (file-name-shadow-mode 1))

(use-package minibuffer
  :ensure nil
  :demand t
  :config
  (setq completions-format 'one-column)
  (setq completion-show-help nil)
  (setq completion-auto-help 'always)
  (setq completion-auto-select nil)
  (setq completions-detailed t)
  (setq completion-show-inline-help nil)
  (setq completions-max-height 6)
  (setq completions-header-format (propertize "%s candidates:\n" 'face 'bold-italic))
  (setq completions-highlight-face 'completions-highlight)
  (setq minibuffer-completion-auto-choose t)
  (setq minibuffer-visible-completions t)
  (setq completions-sort 'historical))

(use-package corfu
  :hook ((after-init . global-corfu-mode))
  :bind ( :map corfu-map
          ("<tab>" . corfu-complete)
          :map corfu-popupinfo-map
          ("C-M-j" . corfu-popupinfo-scroll-up)
          ("C-M-k" . corfu-popupinfo-scroll-down))
  :config
  (setq corfu-cycle t)
  (setq corfu-auto t)
  (setq corfu-auto-prefix 2)
  ;; (setq corfu-auto-delay 0.1)
  (setq corfu-separator ?\s)
  ;; (setq corfu-preselect 'prompt)
  (setq corfu-scroll-margin 5)
  ;; (setq corfu-on-exact-match nil)
  (setq corfu-popupinfo-delay '(0.1 . 0.2))
  (setq corfu-popupinfo-max-width 140)
  (setq corfu-popupinfo-max-height 30)

  (setq corfu-preview-current nil)
  (setq corfu-min-width 20)

  (corfu-popupinfo-mode 1)

  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history)))
