lim-cn.org
*** 动态缩写扩展

#+begin_src emacs-lisp :tangle module/lim-module-completion.el :mkdirp yes
(use-package dabbrev
  :ensure nil
  :commands (dabbrev-expand dabbrev-completion)
  :config
  (setq dabbrev-abbrev-char-regexp "\\sw\\|\\s_")
  (setq dabbrev-abbrev-skip-leading-regexp "[$*/=~']")
  (setq dabbrev-backward-only nil)
  (setq dabbrev-case-distinction 'case-replace)
  (setq dabbrev-case-fold-search nil)
  (setq dabbrev-case-replace 'case-replace)
  (setq dabbrev-check-other-buffers t)
  (setq dabbrev-eliminate-newlines t)
  (setq dabbrev-upcase-means-case-search t)
  (setq dabbrev-ignored-buffer-modes
        '(archive-mode image-mode docview-mode pdf-view-mode)))
#+end_src

*** 代码片段

#+begin_src emacs-lisp :tangle module/lim-module-completion.el :mkdirp yes
(use-package tempel
  :bind
  (("M-+" . tempel-complete)
   ("M-*" . tempel-insert)
   :map tempel-map
   ("<tab>" . tempel-next)
   ("<backtab>" . tempel-previous))
  :init
  (setq tempel-path (expand-file-name "templates/*.eld" user-emacs-directory))
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions (cons #'tempel-expand completion-at-point-functions)))
  :hook
  (conf-mode . tempel-setup-capf)
  (prog-mode . tempel-setup-capf)
  (text-mode . tempel-setup-capf)
  (eglot-managed-mode . tempel-setup-capf)
  :functions (tempel-include)
  :config
  (global-tempel-abbrev-mode)
  (defun tempel-include (elt)
    (when (eq (car-safe elt) 'i)
      (if-let (template (alist-get (cadr elt) (tempel--templates)))
          (cons 'l template)
        (message "Template %s not found" (cadr elt))
        nil)))
  (add-to-list 'tempel-user-elements #'tempel-include))

(use-package yasnippet
  ;; :config
  ;; (yas-global-mode 1)
  )

(use-package yasnippet-snippets
  :after (yasnippet))

;; (use-package yasnippet-capf
;;   :after cape
;;   :config
;;   (add-hook 'completion-at-point-functions #'yasnippet-capf))

(use-package tempel-collection)
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-completion.el :mkdirp yes
(provide 'lim-module-completion)
#+end_src

** lim-module-dired.el 模块

*** 文件管理器

#+begin_src emacs-lisp :tangle module/lim-module-dired.el :mkdirp yes
(use-package dired-sidebar
  :commands (dired-sidebar-toggle-sidebar)
  :hook
  (dired-sidebar-mode . lim-simple-whitespace-disable)
  (dired-sidebar-mode . auto-revert-mode)
  :bind
  ( :map dired-sidebar-mode-map
    ("<mouse-2>" . nil)
    ("<double-mouse-1>" . dired-sidebar-mouse-subtree-cycle-or-find-file))
  :config
  (advice-add 'dired-sidebar-mouse-subtree-cycle-or-find-file :after 'dired-sidebar-revert)
  (setq dired-listing-switches "-Ahlv"))
#+end_src

*** 复制/删除行为

#+begin_src emacs-lisp :tangle module/lim-module-dired.el :mkdirp yes
(use-package dired
  :ensure nil
  :commands (dired)
  :config
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)
  (setq delete-by-moving-to-trash t))
#+end_src

*** 目录选择

#+begin_src emacs-lisp :tangle module/lim-module-dired.el :mkdirp yes
(use-package dired
  :ensure nil
  :commands (dired)
  :config
  (setq dired-dwim-target t))
#+end_src

*** 刷新和钩子

#+begin_src emacs-lisp :tangle module/lim-module-dired.el :mkdirp yes
(use-package dired-x :ensure nil)

(use-package dired
  :ensure nil
  :commands (dired)
  :config
  (setq dired-auto-revert-buffer #'dired-directory-changed-p)
  ;; (setq dired-make-directory-clickable t)
  (setq dired-free-space nil)
  (setq dired-omit-verbose nil)
  ;; (setq dired-mouse-drag-files t)

  (add-hook 'dired-mode-hook #'dired-hide-details-mode)
  (add-hook 'dired-mode-hook #'hl-line-mode)
  (add-hook 'dired-mode-hook #'dired-omit-mode))
#+end_src

*** 回收站

#+begin_src emacs-lisp :tangle module/lim-module-dired.el :mkdirp yes
(use-package trashed
  :commands (trashed)
  :config
  (setq trashed-action-confirmer 'y-or-n-p)
  (setq trashed-use-header-line t)
  (setq trashed-sort-key '("Date deleted" . t))
  (setq trashed-date-format "%Y-%m-%d %H:%M:%S"))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-dired.el :mkdirp yes
(provide 'lim-module-dired)
#+end_src

** lim-module-org.el 模块

*** 日历

配置日历相关的一些显示, 如时区, 农历, 经纬度等信息

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package calendar
  :ensure nil
  :commands (calendar)
  :config
  ;; Show calendar for diary entry
  (setq calendar-mark-diary-entries-flag t)
  ;; Show calendar for holiday
  (setq calendar-mark-holidays-flag t)
  (setq calendar-mode-line-format nil)
  (setq calendar-time-display-form
        '( 24-hours ":" minutes
           (when time-zone (format "(%s)" time-zone))))
  ;; Monday is the first day of the week
  (setq calendar-week-start-day 1)
  ;; Like year/month/day style
  (setq calendar-date-style 'iso)
  ;; Like +0800 style
  (setq calendar-time-zone-style 'numeric)

  (require 'solar)
  ;; Not my actual coordinates
  (setq calendar-longitude (getenv "MY_LONGITUDE"))
  (setq calendar-latitude (getenv "MY_LATITUDE"))

  (require 'cal-dst)
  ;; UTC +8. China Standard Time, Beijing Time
  (setq calendar-standard-time-zone-name "+0800")
  (setq calendar-daylight-time-zone-name "+0800"))
#+end_src

*** 预约

配置预约提示

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package appt
  :ensure nil
  :commands (appt-activate)
  :config
  (require 'notifications)
  (defun appt-disp-window-and-notification (min-to-appt current-time appt-msg)
    (let ((title (format "%s 分钟内有新预约" min-to-appt)))
      (notifications-notify
       ;; Until next reminder
       :timeout (* appt-display-interval 60000)
       :title title
       :body appt-msg
       )
      ;; The original function is also called
      (appt-disp-window min-to-appt current-time appt-msg)))
  (setq appt-display-diary nil
        appt-display-mode-line t
        ;; Reminder interval
        appt-display-interval 5
        ;; Mute
        appt-audible nil
        appt-warning-time-regexp "预约 \\([0-9]+\\)"
        appt-message-warning-time 15)
  ;; Use customize func
  (setq appt-display-format 'window)
  (setq appt-disp-window-function #'appt-disp-window-and-notification)

  (with-eval-after-load 'org-agenda
    (appt-activate 1)
    (org-agenda-to-appt)))
#+end_src

