module/lim-module-completion.el

(use-package dabbrev
  :ensure nil
  :commands (dabbrev-expand dabbrev-completion)
  :config
  (setq dabbrev-abbrev-char-regexp "\\sw\\|\\s_")
  (setq dabbrev-abbrev-skip-leading-regexp "[$*/=~']")
  (setq dabbrev-backward-only nil)
  (setq dabbrev-case-distinction 'case-replace)
  (setq dabbrev-case-fold-search nil)
  (setq dabbrev-case-replace 'case-replace)
  (setq dabbrev-check-other-buffers t)
  (setq dabbrev-eliminate-newlines t)
  (setq dabbrev-upcase-means-case-search t)
  (setq dabbrev-ignored-buffer-modes
        '(archive-mode image-mode docview-mode pdf-view-mode)))

(use-package tempel
  :bind
  (("M-+" . tempel-complete)
   ("M-*" . tempel-insert)
   :map tempel-map
   ("<tab>" . tempel-next)
   ("<backtab>" . tempel-previous))
  :init
  (setq tempel-path (expand-file-name "templates/*.eld" user-emacs-directory))
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions (cons #'tempel-expand completion-at-point-functions)))
  :hook
  (conf-mode . tempel-setup-capf)
  (prog-mode . tempel-setup-capf)
  (text-mode . tempel-setup-capf)
  (eglot-managed-mode . tempel-setup-capf)
  :functions (tempel-include)
  :config
  (global-tempel-abbrev-mode)
  (defun tempel-include (elt)
    (when (eq (car-safe elt) 'i)
      (if-let (template (alist-get (cadr elt) (tempel--templates)))
          (cons 'l template)
        (message "Template %s not found" (cadr elt))
        nil)))
  (add-to-list 'tempel-user-elements #'tempel-include))

(use-package yasnippet
  ;; :config
  ;; (yas-global-mode 1)
  )

(use-package yasnippet-snippets
  :after (yasnippet))

;; (use-package yasnippet-capf
;;   :after cape
;;   :config
;;   (add-hook 'completion-at-point-functions #'yasnippet-capf))

(use-package tempel-collection)

(provide 'lim-module-completion)
