module/lim-module-org.el
(use-package calendar
  :ensure nil
  :commands (calendar)
  :config
  ;; Show calendar for diary entry
  (setq calendar-mark-diary-entries-flag t)
  ;; Show calendar for holiday
  (setq calendar-mark-holidays-flag t)
  (setq calendar-mode-line-format nil)
  (setq calendar-time-display-form
        '( 24-hours ":" minutes
           (when time-zone (format "(%s)" time-zone))))
  ;; Monday is the first day of the week
  (setq calendar-week-start-day 1)
  ;; Like year/month/day style
  (setq calendar-date-style 'iso)
  ;; Like +0800 style
  (setq calendar-time-zone-style 'numeric)

  (require 'solar)
  ;; Not my actual coordinates
  (setq calendar-longitude (getenv "MY_LONGITUDE"))
  (setq calendar-latitude (getenv "MY_LATITUDE"))

  (require 'cal-dst)
  ;; UTC +8. China Standard Time, Beijing Time
  (setq calendar-standard-time-zone-name "+0800")
  (setq calendar-daylight-time-zone-name "+0800"))

(use-package appt
  :ensure nil
  :commands (appt-activate)
  :config
  (require 'notifications)
  (defun appt-disp-window-and-notification (min-to-appt current-time appt-msg)
    (let ((title (format "%s 分钟内有新预约" min-to-appt)))
      (notifications-notify
       ;; Until next reminder
       :timeout (* appt-display-interval 60000)
       :title title
       :body appt-msg
       )
      ;; The original function is also called
      (appt-disp-window min-to-appt current-time appt-msg)))
  (setq appt-display-diary nil
        appt-display-mode-line t
        ;; Reminder interval
        appt-display-interval 5
        ;; Mute
        appt-audible nil
        appt-warning-time-regexp "预约 \\([0-9]+\\)"
        appt-message-warning-time 15)
  ;; Use customize func
  (setq appt-display-format 'window)
  (setq appt-disp-window-function #'appt-disp-window-and-notification)

  (with-eval-after-load 'org-agenda
    (appt-activate 1)
    (org-agenda-to-appt)))

(use-package org
  :ensure nil
  :init
