module/lim-module-org.el
  (setq org-directory "~/org-notes/")
  (setq org-imenu-depth 7)

  (add-to-list 'safe-local-variable-values '(org-hide-leading-stars . t))
  (add-to-list 'safe-local-variable-values '(org-hide-macro-markers . t))
  :mode-hydra
  ((:title "Org-Mode Commands")
   ("Main"
    ( ("l" org-insert-last-stored-link "insert last link")
      ("cl" org-toggle-link-display "toggle link display")
      ("." org-toggle-link-display "toggle link display")
      ("i" lim-org-id-headlines "id headline" :color blue)
      ("h" lim-org-ox-html "ox html" :color blue)
      )
    ))
  :bind
  ( :map global-map
    ("C-c o l" . org-store-link)
    ("C-c o a" . org-agenda)
    ("C-c o c" . org-capture)
    ("C-c o o" . org-open-at-point-global)
    :map org-mode-map
    ;; So many bindings one zillion keys and most of them useless, disable it!
    ("C-'" . nil)
    ("C-," . nil)
    ("M-;" . nil)
    ("<C-return>" . nil)
    ("<C-S-return>" . nil)
    ("C-M-S-<right>" . nil)
    ("C-M-S-<left>" . nil)
    ("C-c ;" . nil)

    ("C-c l" . org-insert-last-stored-link)
    ("C-c C-l" . org-toggle-link-display)
    ("M-." . org-edit-special)

    :map org-src-mode-map
    ("M-," . org-edit-src-exit)

    :map narrow-map
    ("b" . org-narrow-to-block)
    ("e" . org-narrow-to-element)
    ("s" . org-narrow-to-subtree)

    :map ctl-x-x-map
    ("i" . lim-org-id-headlines)
    ("h" . lim-org-ox-html))
  :config
  ;; My custom extras, which I use for the agenda and a few other Org features.
  (require 'lim-org)
  (require 'org-tempo)

  ;; general settings
  (setq org-M-RET-may-split-line '((default . nil)))
  ;; (setq org-cycle-separator-lines 0)
  (setq org-adapt-indentation nil)
  (setq org-structure-template-alist
        '(("s" . "src")
          ("e" . "src emacs-lisp")
          ("E" . "src emacs-lisp :results value code :lexical t")
          ("t" . "src emacs-lisp :tangle FILENAME")
          ("T" . "src emacs-lisp :tangle FILENAME :mkdirp yes")
          ("x" . "example")
          ("X" . "export")
          ("q" . "quote")))
  (setq org-catch-invisible-edits 'show)
  (setq org-loop-over-headlines-in-active-region 'start-level)
  (setq org-modules '(ol-info ol-eww))
  (setq org-use-sub-superscripts '{})
  (setq org-insert-heading-respect-content t)
  (setq org-read-date-prefer-future 'time)
  ;; other options affect elisp regexp in src blocks
  (setq org-highlight-latex-and-related '(latex))
  (setq org-fontify-quote-and-verse-blocks t)
  (setq org-fontify-whole-block-delimiter-line t)
  (setq org-track-ordered-property-with-tag t)
  (setq org-highest-priority ?A)
  (setq org-lowest-priority ?C)
  (setq org-default-priority ?A)
  (setq org-priority-faces nil)

  (defun lim/org-disable-angle-bracket ()
    (setq-local electric-pair-inhibit-predicate
                `(lambda (c)
                   (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))))

  (add-hook 'org-mode-hook 'lim/org-disable-angle-bracket)

  ;; See my `pulsar' package, defined elsewhere in this setup.
  (with-eval-after-load 'pulsar
    (dolist (hook '(org-agenda-after-show-hook org-follow-link-hook))
      (add-hook hook #'pulsar-recenter-center)
      (add-hook hook #'pulsar-reveal-entry))))

(use-package org
  :ensure nil
  :config
  (setq org-refile-targets
        '((org-agenda-files . (:maxlevel . 2))
          (nil . (:maxlevel . 2))))
  (setq org-refile-use-outline-path t)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-refile-use-cache t)
  (setq org-reverse-note-order nil)

  (setq org-todo-keywords
        '((sequence "TODO(t)" "DOING(i!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@/!)")
          (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f!)")
          ))

  (setq org-todo-keyword-faces
        '(("TODO" . (:foreground "#FF9966" :weight bold))
          ("DOING" . (:foreground "#6699FF" :weight bold))
          ("WAIT" . (:foreground "#333399" :weight bold))
          ("REPORT" . (:foreground "#6666CC" :weight bold))
          ("BUG" . (:foreground "#FF0066" :weight bold))
          ("KNOWNCAUSE" . (:foreground "#99CC33" :weight bold))
          ("CANCELED" . (:foreground "#FF6666" :weight bold))
          ("DONE" . (:foreground "#22AA66" :weight bold))
          ("FIXED" . (:foreground "#00AA00" :weight bold))
          ))
  (setq org-use-fast-todo-selection 'expert)

  (setq org-fontify-done-headline nil)
  (setq org-fontify-todo-headline nil)
  (setq org-fontify-whole-heading-line nil)
  (setq org-enforce-todo-dependencies t)
  (setq org-enforce-todo-checkbox-dependencies t))

(use-package org
  :ensure nil
  :config
  (setq org-tag-alist nil)
  (setq org-auto-align-tags nil)
  (setq org-tags-column 0))

(use-package org
  :ensure nil
  :config
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-log-note-clock-out nil)
  (setq org-log-redeadline 'time)
  (setq org-log-reschedule 'time))

(use-package org
  :ensure nil
  :config
  (require 'lim-org)

  (setq org-link-context-for-files t)
  (setq org-link-keep-stored-after-insertion nil)
  (setq org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id))

(use-package org
  :ensure nil
  :config
  (setq org-confirm-babel-evaluate nil)
  (setq org-src-window-setup 'current-window)
  (setq org-edit-src-persistent-message nil)
  (setq org-src-fontify-natively t)
  (setq org-src-preserve-indentation t)
  (setq org-src-tab-acts-natively t)
  (setq org-edit-src-content-indentation 0))

(use-package org
  :ensure nil
  :init
  (setq org-export-backends '(html texinfo md))
  :config
  (setq org-export-with-toc t)
  (setq org-export-headline-levels 8)
  (setq org-export-dispatch-use-expert-ui nil)
  (setq org-html-htmlize-output-type nil)
  (setq org-html-head-include-default-style nil)
  (setq org-html-head-include-scripts nil))

(use-package org
  :ensure nil
  :config
  (prettify-symbols-mode 1)
  (setq prettify-symbols-unprettify-at-point t))

(use-package display-line-numbers
  :hook (org-mode . (lambda () (display-line-numbers-mode -1))))
