lim-cn.org
*** 文档笔记捕获(capture)

=Capture= 可让你快速存储笔记, 几乎不会中断你的工作流程

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package org-capture
  :ensure nil
  :config
  (require 'lim-org)

  (setq org-capture-templates
        `(("i" "灵感" entry
           (file+headline "inbox.org" "INSPIRE")
           ,(concat
             "* %^{Title}\n"
             ":PROPERTIES:\n"
             ":CAPTURED: %U\n"
             ":END:\n\n"
             "%i %l")
           :empty-lines 1)
          ("t" "临时" entry
           (file+headline "inbox.org" "TEMPORARY")
           ,(concat
             "* TODO [#B] %^{Title}\n"
             ":PROPERTIES:\n"
             ":EFFORT: %^{Effort estimate in minutes|5|10|15|30|45|60|90|120}\n"
             ":END:\n\n"
             "%a\n")
           :prepend t
           :clock-in t
           :clock-keep t
           :immediate-finish t
           :empty-lines 1)
          ("l" "闲时" entry
           (file+olp+datetree "leisure.org")
           ,(concat
             "* TODO [#C] %^{Title}\n"
             ":PROPERTIES:\n"
             ":CAPTURED: %U\n"
             ":END:\n\n"
             "%i%?")
           :empty-lines 1
           :tree-type month)
          ("g" "GTD" entry
           (file+olp+datetree "gtd.org")
           ,(concat
             "* TODO [#B] %^{Title} %^g\n"
             "SCHEDULED: %^t\n"
             "DEADLINE: %^t\n"
             ":PROPERTIES:\n"
             ":CAPTURED: %U\n"
             ":END:\n\n"
             "%a\n%i%?")
           :empty-lines 1
           :tree-type week)
          ))
  )
#+end_src

*** 中国农历假期

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package cal-china-x
  :config
  (setq mark-holidays-in-calendar t)
  (setq cal-china-x-important-holidays cal-china-x-chinese-holidays)
  (setq calendar-holidays
        (append cal-china-x-important-holidays
                cal-china-x-general-holidays
                holiday-general-holidays
                holiday-christian-holidays)))
#+end_src

*** 会议安排

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package org-agenda
  :ensure nil
  :config
  (require 'solar)
  (require 'lim-org)

  (defun lim/org-agenda-format-date-aligned (date)
    "Format a DATE string for display in the daily/weekly agenda, or timeline.

This function makes sure that dates are aligned for easy reading."
    (require 'cal-iso)
    (let* ((dayname (aref cal-china-x-days
                          (calendar-day-of-week date)))
           (day (cadr date))
           (month (car date))
           (year (nth 2 date))
           (cn-date (calendar-chinese-from-absolute (calendar-absolute-from-gregorian date)))
           (cn-month (cl-caddr cn-date))
           (cn-day (cl-cadddr cn-date))
           (cn-month-string (concat (aref cal-china-x-month-name
                                          (1- (floor cn-month)))
                                    (if (integerp cn-month)
                                        ""
                                      "(闰月)")))
           (cn-day-string (aref cal-china-x-day-name
                                (1- cn-day))))
      (format "%04d-%02d-%02d 周%s %s%s" year month
              day dayname cn-month-string cn-day-string)))

  (setq org-default-notes-file (expand-file-name ".notes" org-directory))
  (setq org-agenda-include-diary t)
  (setq diary-file (expand-file-name "standard-diary" org-directory))
  (setq org-agenda-diary-file 'diary-file)
  (setq org-agenda-time-grid
        '((daily today require-timed)
          (0300 0600 0900 1200 1500 1800 2100 2400)
          "......" "------------------------"))
  (setq org-agenda-format-date 'lim/org-agenda-format-date-aligned)

  (setq org-agenda-files `(,org-directory))
  (setq org-agenda-span 'week)
  (setq org-agenda-start-on-weekday 1)
  (setq org-agenda-confirm-kill t)
  (setq org-agenda-show-all-dates t)
  (setq org-agenda-show-outline-path nil)
  (setq org-agenda-window-setup 'current-window)
  (setq org-agenda-skip-comment-trees t)

  (setq org-agenda-scheduled-leaders
        '("Scheduled: " "Sched.%2dx: "))
  (setq org-agenda-inactive-leader "[")
  (setq org-agenda-deadline-leaders
        '("Deadline:  " "In %3d d.: " "%2d d. ago: "))

  (setq org-agenda-current-time-string "← now ──────────────────")
  )
#+end_src

*** 文档美化

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package org-modern
  :hook
  (org-mode . org-modern-mode)
  (org-agenda-finalize . org-modern-agenda)
  :config
  (setq org-modern-table nil)
  (setq org-pretty-entities t)
  (setq org-hide-emphasis-markers t)

  (setq org-modern-list
        '( ;(?+ . "➣")
          (?+ . "∙")
          (?- . "◦")
          (?* . "‣")
          ))
  )
#+end_src

*** 窗口美化(Olivetti)

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package olivetti
  :hook org-mode)
#+end_src

*** 文档美化增强

进入隐藏修饰标签时, 自动展开

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(use-package org-appear
  :hook org-modern-mode
  :config
  (setq org-appear-autolinks t))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-org.el :mkdirp yes
(provide 'lim-module-org)
#+end_src

** lim-module-window.el 模块

*** 窗口移动

允许窗口在水平/垂直方向循环移动

#+begin_src emacs-lisp :tangle module/lim-module-window.el :mkdirp yes
(use-package windmove
  :ensure nil
  :config
  (setq windmove-wrap-around t))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-window.el :mkdirp yes
(provide 'lim-module-window)
#+end_src

** lim-module-ai.el 模块

*** Tabby

#+begin_src emacs-lisp :tangle module/lim-module-ai.el :mkdirp yes
(use-package tabby
  :vc ( :url "https://github.com/alan-w-255/tabby.el.git")
  :bind
  (("C-'" . tabby-complete)
   :map tabby-completion-map
   ("<tab>" . tabby-accept-completion)
   ("C-<return>" . tabby-accept-completion-by-word)
   ("C-l" . tabby-accept-completion-by-line))
  :commands (tabby-accept-completion)
  :defines (taby-mode-map tabby--ongoing-request-id)
  ;; :hook
  ;; (go-ts-mode . tabby-mode)
  ;; (tuareg-mode . tabby-mode)
  ;; (haskell-mode . tabby-mode)
  :config
  (setq tabby-idle-delay 1.5))
#+end_src

*** GPT

#+begin_src emacs-lisp :tangle module/lim-module-ai.el :mkdirp yes
(use-package gptel
  :ensure t
  :defer 1
  :bind
  ( :map gptel-mode-map
    ("<RET>" . gptel-send))
  :config
  (setq gptel-default-mode 'org-mode)
  :init
  (setq-default gptel-model "Qwen2-1.5B-Instruct")
  (setq-default gptel-backend
                (gptel-make-openai "tabby"
                  :stream t
                  :protocol "http"
                  :host "localhost:18080"
                  :key "auth_df7bf9e69c29473f8e2ba10eea95a048"
                  :models '("Qwen2-1.5B-Instruct"))
                )
  (add-hook 'gptel-post-response-functions 'gptel-end-of-response))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-ai.el :mkdirp yes
(provide 'lim-module-ai)
#+end_src

** lim-module-dev.el 模块

*** 加载 lim-dev 库

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package lim-dev :ensure nil)
#+end_src

*** 文件结构(imenu-list)

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package imenu-list
  :config
  (setq-default imenu-list-mode-line-format
        '("%e"
          (:propertize "%b" face mode-line-buffer-id) " - "
          (:eval (buffer-name imenu-list--displayed-buffer)) " "
          )))
#+end_src

