module/lim-module-dev.el
(use-package lim-dev :ensure nil)

(use-package imenu-list
  :config
  (setq-default imenu-list-mode-line-format
        '("%e"
          (:propertize "%b" face mode-line-buffer-id) " - "
          (:eval (buffer-name imenu-list--displayed-buffer)) " "
          )))
