module/lim-module-org.el

(use-package org-capture
  :ensure nil
  :config
  (require 'lim-org)

  (setq org-capture-templates
        `(("i" "灵感" entry
           (file+headline "inbox.org" "INSPIRE")
           ,(concat
             "* %^{Title}\n"
             ":PROPERTIES:\n"
             ":CAPTURED: %U\n"
             ":END:\n\n"
             "%i %l")
           :empty-lines 1)
          ("t" "临时" entry
           (file+headline "inbox.org" "TEMPORARY")
           ,(concat
             "* TODO [#B] %^{Title}\n"
             ":PROPERTIES:\n"
             ":EFFORT: %^{Effort estimate in minutes|5|10|15|30|45|60|90|120}\n"
             ":END:\n\n"
             "%a\n")
           :prepend t
           :clock-in t
           :clock-keep t
           :immediate-finish t
           :empty-lines 1)
          ("l" "闲时" entry
           (file+olp+datetree "leisure.org")
           ,(concat
             "* TODO [#C] %^{Title}\n"
             ":PROPERTIES:\n"
             ":CAPTURED: %U\n"
             ":END:\n\n"
             "%i%?")
           :empty-lines 1
           :tree-type month)
          ("g" "GTD" entry
           (file+olp+datetree "gtd.org")
           ,(concat
             "* TODO [#B] %^{Title} %^g\n"
             "SCHEDULED: %^t\n"
             "DEADLINE: %^t\n"
             ":PROPERTIES:\n"
             ":CAPTURED: %U\n"
             ":END:\n\n"
             "%a\n%i%?")
           :empty-lines 1
           :tree-type week)
          ))
  )

(use-package cal-china-x
  :config
  (setq mark-holidays-in-calendar t)
  (setq cal-china-x-important-holidays cal-china-x-chinese-holidays)
  (setq calendar-holidays
        (append cal-china-x-important-holidays
                cal-china-x-general-holidays
                holiday-general-holidays
                holiday-christian-holidays)))

(use-package org-agenda
  :ensure nil
  :config
  (require 'solar)
  (require 'lim-org)

  (defun lim/org-agenda-format-date-aligned (date)
    "Format a DATE string for display in the daily/weekly agenda, or timeline.

This function makes sure that dates are aligned for easy reading."
    (require 'cal-iso)
    (let* ((dayname (aref cal-china-x-days
                          (calendar-day-of-week date)))
           (day (cadr date))
           (month (car date))
           (year (nth 2 date))
           (cn-date (calendar-chinese-from-absolute (calendar-absolute-from-gregorian date)))
           (cn-month (cl-caddr cn-date))
           (cn-day (cl-cadddr cn-date))
           (cn-month-string (concat (aref cal-china-x-month-name
                                          (1- (floor cn-month)))
                                    (if (integerp cn-month)
                                        ""
                                      "(闰月)")))
           (cn-day-string (aref cal-china-x-day-name
                                (1- cn-day))))
      (format "%04d-%02d-%02d 周%s %s%s" year month
              day dayname cn-month-string cn-day-string)))

  (setq org-default-notes-file (expand-file-name ".notes" org-directory))
  (setq org-agenda-include-diary t)
  (setq diary-file (expand-file-name "standard-diary" org-directory))
  (setq org-agenda-diary-file 'diary-file)
  (setq org-agenda-time-grid
        '((daily today require-timed)
          (0300 0600 0900 1200 1500 1800 2100 2400)
          "......" "------------------------"))
  (setq org-agenda-format-date 'lim/org-agenda-format-date-aligned)

  (setq org-agenda-files `(,org-directory))
  (setq org-agenda-span 'week)
  (setq org-agenda-start-on-weekday 1)
  (setq org-agenda-confirm-kill t)
  (setq org-agenda-show-all-dates t)
  (setq org-agenda-show-outline-path nil)
  (setq org-agenda-window-setup 'current-window)
  (setq org-agenda-skip-comment-trees t)

  (setq org-agenda-scheduled-leaders
        '("Scheduled: " "Sched.%2dx: "))
  (setq org-agenda-inactive-leader "[")
  (setq org-agenda-deadline-leaders
        '("Deadline:  " "In %3d d.: " "%2d d. ago: "))

  (setq org-agenda-current-time-string "← now ──────────────────")
  )

(use-package org-modern
  :hook
  (org-mode . org-modern-mode)
  (org-agenda-finalize . org-modern-agenda)
  :config
  (setq org-modern-table nil)
  (setq org-pretty-entities t)
  (setq org-hide-emphasis-markers t)

  (setq org-modern-list
        '( ;(?+ . "➣")
          (?+ . "∙")
          (?- . "◦")
          (?* . "‣")
          ))
  )

(use-package olivetti
  :hook org-mode)

(use-package org-appear
  :hook org-modern-mode
  :config
  (setq org-appear-autolinks t))

(provide 'lim-module-org)
