module/lim-module-dev.el

(use-package magit
  :defer t
  :commands magit-status
  :config
  (setq magit-diff-refine-hunk 'all)
  (setq magit-display-buffer-function
        'magit-display-buffer-fullframe-status-v1)
  (setq magit-ediff-dwim-show-on-hunks t)
  (setq magit-log-arguments
        '("--graph" "--color" "--decorate" "--show-signature" "--follow" "-n256"))
  (setq magit-log-margin-show-committer-date t)
  (setq magit-log-remove-graph-args
        '("--follow" "--grep" "-G" "-S" "-L"))
  (setq magit-todos-insert-after'(bottom))
  )

(use-package magit-todos :after magit)

(use-package magit-delta
  :after magit
  :hook (magit-mode . magit-delta-mode)
  :config
  (setq magit-delta-default-dark-theme "ef-elea-dark"))

(use-package forge
  :after magit
  :demand t
  :custom-face
  (forge-topic-label ((t (:inherit variable-pitch :height 0.9 :width condensed :weight regular :underline nil))))
  :init (setq forge-topic-list-columns
              '(("#" 5 forge-topic-list-sort-by-number (:right-align t) number nil)
                ("Title" 60 t nil title  nil)
                ("State" 6 t nil state nil)
                ("Updated" 10 t nil updated nil))))

(use-package vc-hooks
  :ensure nil
  :config
  (setq vc-follow-symlinks t)
  (setq vc-allow-async-revert t)
  ;; (setq vc-handled-backends '(Git))
  )

(use-package diff-hl
  :hook ((after-init         . global-diff-hl-mode)
         (dired-mode         . diff-hl-dired-mode-unless-remote)
         (magit-pre-refresh  . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh))
  :config
  ;; When Emacs runs in terminal, show the indicators in margin instead.
  (unless (display-graphic-p)
    (diff-hl-margin-mode)))

(use-package ediff
  :ensure nil
  :hook ((ediff-before-setup . ediff-save-window-conf)
         (ediff-quit         . ediff-restore-window-conf))
  :config
  (defvar local-ediff-saved-window-conf nil)

  (defun ediff-save-window-conf ()
    (setq local-ediff-saved-window-conf (current-window-configuration)))

  (defun ediff-restore-window-conf ()
    (when (window-configuration-p local-ediff-saved-window-conf)
      (set-window-configuration local-ediff-saved-window-conf)))
  :custom
  (ediff-highlight-all-diffs t)
  (ediff-window-setup-function 'ediff-setup-windows-plain)
  (ediff-split-window-function 'split-window-horizontally)
  (ediff-merge-split-window-function 'split-window-horizontally))

(use-package git-gutter
  :defer t
  :config
  (global-git-gutter-mode 1))

(use-package git-gutter-fringe
  :after git-gutter
  :config
  (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

(use-package blamer
  :defer 20
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                   :background unspecified
                   :height 140
                   :italic t)))
  :config
  (setq blamer-idle-time 0.3)
  (setq blamer-min-offset 80)

  (global-blamer-mode 1))

(use-package git-modes
  :mode ("/.dockerignore\\'" . gitignore-mode))

(use-package browse-at-remote
  :bind (:map vc-prefix-map
              ("B" . browse-at-remote)))

(use-package ws-butler
  :diminish
  :config
  (ws-butler-global-mode 1))

(use-package whitespace-cleanup-mode
  :diminish
  :commands whitespace-cleanup-mode)

(use-package editorconfig
  :diminish
  :config
  (setq editorconfig-trim-whitespaces-mode 'ws-butler-mode)
  (editorconfig-mode 1))

(use-package goto-addr
  :ensure nil
  :hook
  ((text-mode . goto-address-mode)
   (prog-mode . goto-address-prog-mode))
  :bind
  (("<mouse-2>" . ignore)
   :map goto-address-highlight-keymap
   ("<mouse-2>" . ignore))
  :config
  (setq goto-address-url-mouse-face nil)
  (setq goto-address-mail-mouse-face nil))

(use-package lim-project
  :ensure nil
  :autoload (lim-project-root)
  :hook (after-init . global-lim-project-mode))

(use-package lim-treesit :ensure nil)

;; (use-package tabspaces
;;   :hook (after-init . tabspaces-mode)
;;   :config
;;   (setq tab-bar-show nil)

;;   (setq tabspaces-use-filtered-buffers-as-default t)
;;   (setq tabspaces-default-tab "Default")
;;   (setq tabspaces-remove-to-default t)
;;   (setq tabspaces-include-buffers '("*scratch*" "*Messages*"))
;;   ;; sessions
;;   (setq tabspaces-session t)
;;   (setq tabspaces-session-auto-restore t)

;;   ;; Filter Buffers for Consult-Buffer
;;   (with-eval-after-load 'consult
;;     ;; hide full buffer list (still available with "b" prefix)
;;     (consult-customize consult--source-buffer :hidden t :default nil)
;;     ;; set consult-workspace buffer list
;;     (defvar consult--source-workspace
;;       (list :name     "Workspace Buffer"
;;             :narrow   ?w
;;             :history  'buffer-name-history
;;             :category 'buffer
;;             :state    #'consult--buffer-state
;;             :default  t
;;             :items    (lambda () (consult--buffer-query
;;                                   :predicate #'tabspaces--local-buffer-p
;;                                   :sort 'visibility
;;                                   :as #'buffer-name)))
;;       "Set workspace buffer list for consult-buffer.")
;;     (add-to-list 'consult-buffer-sources 'consult--source-workspace))
;;   )

(use-package eglot
  :ensure nil
  :config
  (setq eglot-autoshutdown t))

(use-package eglot-booster
  :vc ( :url "https://github.com/jdtsmith/eglot-booster.git"
        :rev :newest)
	:after eglot
	:config	(eglot-booster-mode))

(use-package consult-eglot)

(use-package consult-eglot-embark
  :config
  (with-eval-after-load 'embark
    (consult-eglot-embark-mode)))

(use-package flycheck)
