module/lim-module-dev.el

(use-package lsp-mode
  :commands (lsp lsp-format-buffer lsp-organize-imports)
  :diminish
  :init
  (setq lsp-keymap-prefix "C-c l")
  (setq lsp-log-io t)
  ;; (setq lsp-keep-workspace-alive nil)
  ;; (setq lsp-signature-auto-activate nil)
  ;; (setq lsp-progress-spinner-type 'progress-bar-filled)
  ;; (setq lsp-enable-file-watchers nil)
  ;; (setq lsp-enable-folding nil)
  ;; (setq lsp-enable-symbol-highlighting nil)
  ;; (setq lsp-enable-text-document-color nil)
  ;; (setq lsp-enable-indentation nil)
  ;; (setq lsp-enable-on-type-formatting nil)
  :hook
  ((markdown-mode yaml-mode yaml-ts-mode) . lsp-deferred)
  :config
  (defun lsp-booster--advice-json-parse (old-fn &rest args)
    "Try to parse bytecode instead of json."
    (or
     (when (equal (following-char) ?#)
       (let ((bytecode (read (current-buffer))))
         (when (byte-code-function-p bytecode)
           (funcall bytecode))))
     (apply old-fn args)))
  
  (advice-add (if (progn (require 'json)
                         (fboundp 'json-parse-buffer))
                  'json-parse-buffer
                'json-read)
              :around
              #'lsp-booster--advice-json-parse)

  (defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
    "Prepend emacs-lsp-booster command to lsp CMD."
    (let ((orig-result (funcall old-fn cmd test?)))
      ;; for check lsp-server-present?
      (if (and (not test?)
               ;; see lsp-resolve-final-command, it would add extra shell wrapper
               (not (file-remote-p default-directory))
               lsp-use-plists
               ;; native json-rpc
               (not (functionp 'json-rpc-connection))
               (executable-find "emacs-lsp-booster"))
          (progn
            ;; resolve command from exec-path (in case not found in $PATH)
            (when-let ((command-from-exec-path (executable-find (car orig-result))))
              (setcar orig-result command-from-exec-path))
            (message "Using emacs-lsp-booster for %s!" orig-result)
            (cons "emacs-lsp-booster" orig-result))
        orig-result)))
  
  (advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command))

(use-package lsp-mode
  :custom
  ;; we use Corfu!
  (lsp-completion-provider :none)
  :init
  (defun lim/lsp-mode-setup-completion ()
    "Configure corfu for lsp-mode"
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless flex basic))
    (add-hook 'orderless-style-dispatchers #'lim-orderless-dispatch-flex-first nil t)
    ;; Optionally configure the cape-capf-buster.
    (setq-local completion-at-point-functions (list (cape-capf-buster #'lsp-completion-at-point))))
  
  :hook
  (lsp-completion-mode . lim/lsp-mode-setup-completion))

(use-package lsp-ui :commands lsp-ui-mode)

;; (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

(use-package dap-mode :after lsp-mode :config (dap-auto-configure-mode))

(use-package consult-lsp
  :bind
  ( :map lsp-mode-map
    ("C-M-." . consult-lsp-symbols)))

(use-package lsp-bridge
  :vc ( :url "https://github.com/manateelazycat/lsp-bridge.git"
        :rev :newest)
  :commands (lsp-bridge-mode lsp-bridge-code-format)
  :diminish
  :defer t
  :bind
  ( :map lsp-bridge-mode-map
    ([remap xref-find-definitions] . lsp-bridge-find-def)
    ([remap xref-find-references] . lsp-bridge-find-references)
    ([remap xref-go-back] . lsp-bridge-find-def-return))
  :init
  (setq lsp-bridge-org-babel-lang-list nil)
  :config
  (setq lsp-bridge-enable-log t)
  (setq lsp-bridge-user-langserver-dir (f-join (lim-project-root) lim-project-identifier "lspserver"))
  (setq lsp-bridge-user-multiserver-dir (f-join (lim-project-root) lim-project-identifier "multilspserver"))
  (setq lsp-bridge-enable-hover-diagnostic t))

(use-package lim-lsp :ensure nil)

(use-package sh-script
  :ensure nil
  :hook
  (sh-mode . bash-ts-mode)
  :init
  (lim-treesit-enable 'bash))

(use-package c-ts-mode
  :ensure nil
  :init
  (lim-treesit-enable 'c))

(use-package cc-mode
  :ensure nil
  :hook (c-mode . c-ts-mode))

(use-package c-ts-mode
  :ensure nil
  :init
  (lim-treesit-enable 'cpp)
  (add-to-list 'major-mode-remap-alist '(c-or-c++-mode . c-or-c++-ts-mode)))

(use-package cc-mode
  :ensure nil
  :hook
  (c++-mode . c-ts-mode)
  (c-or-c++-mode . c-or-c++-ts-mode))

(use-package css-mode
  :ensure nil
  :hook (css-mode . css-ts-mode)
  :init
  (lim-treesit-enable 'css))

(use-package cmake-ts-mode
  :ensure nil
  :init
  (lim-treesit-enable 'cmake))

(use-package cmake-mode
  :hook (cmake-mode . cmake-ts-mode))

(use-package csharp-mode
  :ensure nil
  :hook (csharp-mode . csharp-ts-mode)
  :init
  (lim-treesit-enable 'c-sharp))

(use-package dockerfile-ts-mode
  :init
  (lim-treesit-enable 'dockerfile))

(use-package dockerfile-mode
  :hook
  (dockerfile-mode . dockerfile-ts-mode))

(use-package elisp-mode
  :ensure nil
  :functions (lim/elisp-ts-support)
  :hook (emacs-lisp-mode . lim/elisp-ts-support)
  :init
  (lim-treesit-enable 'elisp)

  (defun lim/elisp-ts-support ()
    (when (treesit-language-available-p 'elisp)
      (treesit-parser-create 'elisp)
      (treesit-major-mode-setup))))

(use-package go-ts-mode
  :ensure nil
