module/lim-module-dev.el
  :functions (lim/whitespace-no-tab lim/install-go-tools)
  ;; :mode
  ;; ("\\.go\\'" . go-ts-mode)
  :hook
  (go-ts-mode . lim-lsp-ensure-for-eglot)
  (go-ts-mode . lim/whitespace-no-tab)
  (go-ts-mode . lim/install-go-tools)
  :init
  (lim-treesit-enable 'go)
  :config
  (setq go-ts-mode-indent-offset 2)

  (defun lim/whitespace-no-tab ()
    "Buffer local `whitespace-style'."
    (make-local-variable 'whitespace-style)
    (setq whitespace-style
          '(face trailing lines-tail missing-newline-at-eof)))

  (defun lim/install-go-tools ()
    "Install some go tools."
    (call-interactively 'lim-dev-install-go-tools))

  (cl-defmethod eglot-initialization-options (server &context (major-mode go-ts-mode))
    (lim-lsp-load-lsp-options "gopls"))
  )

;; (use-package flycheck-golangci-lint
;;   :hook (go-ts-mode . flycheck-golangci-lint-setup))

;; (use-package flymake-golangci
;;   :hook (go-ts-mode . flymake-golangci-load))

;; (use-package lim-flymake-golangci
;;   :ensure nil
;;   :functions (lim/golangci-config)
;;   :hook
;;   (eglot-managed-mode . lim/golangci-config)
;;   ;; (go-mode . flymake-golangci-load-backend)
;;   (go-ts-mode . flymake-golangci-load-backend)
;;   :config
;;   (defun lim/golangci-config ()
;;     (when (derived-mode-p '(go-mode go-ts-mode))
;;       (flymake-golangci-load-backend))))

(use-package go-mode
  :hook
  (go-mode . go-ts-mode)
  :config
  (setq gofmt-command "goimports")
  (add-to-list 'lim-dev-go-tools-alist
               '(gopls . "golang.org/x/tools/gopls"))
  (add-to-list 'lim-dev-go-tools-alist
               '(godef . "github.com/rogpeppe/godef"))
  (add-to-list 'lim-dev-go-tools-alist
               '(goimports . "golang.org/x/tools/cmd/goimports"))
  (add-to-list 'lim-dev-go-tools-alist
               '(godoc . "golang.org/x/tools/cmd/godoc"))
  (add-to-list 'lim-dev-go-tools-alist
               '(golangci-lint-langserver . "github.com/nametake/golangci-lint-langserver"))
  (add-to-list 'lim-dev-go-tools-alist
               '(golangci-lint . "github.com/golangci/golangci-lint/cmd/golangci-lint")))

(use-package godoctor
  :config
  (add-to-list 'lim-dev-go-tools-alist
               '(godoctor . "github.com/godoctor/godoctor")))

(use-package go-tag
  :config
  (add-to-list 'lim-dev-go-tools-alist
               '(gomodifytags . "github.com/fatih/gomodifytags")))

(use-package go-playground)

(use-package go-fill-struct
  :config
  (add-to-list 'lim-dev-go-tools-alist
               '(fillstruct . "github.com/davidrjenni/reftools/cmd/fillstruct")))

(use-package gotest)

(use-package go-gen-test
  :config
  (add-to-list 'lim-dev-go-tools-alist
               '(gotests . "github.com/cweill/gotests/...")))

(use-package go-impl
  :config
  (add-to-list 'lim-dev-go-tools-alist
               '(impl . "github.com/josharian/impl"))
  (add-to-list 'lim-dev-go-tools-alist
               '(godoc . "golang.org/x/tools/cmd/godoc")))

(use-package go-dlv
  :config
  (add-to-list 'lim-dev-go-tools-alist
               '(dlv . "github.com/go-delve/delve/cmd/dlv")))

(use-package go-ts-mode
  :ensure nil
  ;; :mode
  ;; ("go\\.mod\\'" . go-mod-ts-mode)
  :hook
  (go-mod-ts-mode . lim/whitespace-no-tab)
  :init
  (lim-treesit-enable 'gomod))

(use-package go-mode
  :hook
  (go-dot-mod-mode . go-mod-ts-mode))

(use-package haskell-mode
  :functions (lim/haskell-ts-support)
  :hook
  (haskell-mode . lim/haskell-ts-support)
  (haskell-mode . lim-lsp-ensure-for-eglot)
  :init
  (lim-treesit-enable 'haskell)

  (defun lim/haskell-ts-support ()
    (treesit-parser-create 'haskell)
    (treesit-major-mode-setup)))

(use-package html-ts-mode
  :ensure nil
  :init (lim-treesit-enable 'html))

;; (use-package sgml-mode
;;   :ensure nil
;;   :hook ((html-mode mhtml-mode sgml-mode) . html-ts-mode))

(use-package java-ts-mode
  :ensure nil
  :hook
  (java-ts-mode . lim-lsp-ensure-for-lsp-bridge)
  :init (lim-treesit-enable 'java)
  :config
  (setq java-ts-mode-indent-offset 4)

  ;; (cl-defmethod eglot-initialization-options (server &context (major-mode java-ts-mode))
  ;;   (lim-lsp-load-lsp-options "jdtls"))
  )

(use-package cc-mode
  :ensure nil
  :hook (java-mode . java-ts-mode))

(use-package js
  :ensure nil
  :hook
  (js-ts-mode . lim-lsp-ensure-for-eglot)
  (js-mode . js-ts-mode)
  (javascript-mode . js-ts-mode)
  :init (lim-treesit-enable 'javascript))

(use-package json-ts-mode
  :ensure nil
  :hook
  (json-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'json)
  :config
  (setq json-ts-mode-indent-offset 2))

(use-package js
  :ensure nil
  :hook (js-json-mode . json-ts-mode))

(use-package json-mode
  :hook ((json-mode jsonc-mode) . json-ts-mode))

(use-package json-navigator)

(use-package kotlin-ts-mode
  :mode "\\.kts?\\'"
  :hook
  (kotlin-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'kotlin))

;; (use-package kotlin-mode
;;   :hook (kotlin-mode . kotlin-ts-mode))

(use-package lua-ts-mode
  :ensure nil
  :hook
  (lua-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'lua))

(use-package make-mode
  :ensure nil
  :functions (lim/make-ts-support)
  :hook (makefile-mode . lim/make-ts-support)
  :init
  (lim-treesit-enable 'make)

  (defun lim/make-ts-support ()
    (treesit-parser-create 'make)
    (treesit-major-mode-setup)))

(use-package markdown-ts-mode
  :commands markdown-ts-mode
  :hook
  (markdown-ts-mode . lim-lsp-ensure-for-eglot)
  :init
  (lim-treesit-enable 'markdown)
  (lim-treesit-enable 'markdown-inline)
  (add-to-list 'eglot-server-programs '(markdown-ts-mode . ("marksman" "server"))))

(use-package markdown-mode
  :functions (lim/markdown-ts-support)
  :hook (markdown-mode . lim/markdown-ts-support)
  :init
  (lim-treesit-enable 'markdown)
  (lim-treesit-enable 'markdown-inline)

  (defun lim/markdown-ts-support ()
    (treesit-parser-create 'markdown)
    (treesit-major-mode-setup)))

(use-package ocaml-ts-mode
  :hook
  (ocaml-ts-mode . lim-lsp-ensure-for-eglot)
  :init
  (lim-treesit-enable 'ocaml))

(use-package tuareg
  :hook (tuareg-mode . ocaml-ts-mode))

(use-package caml
  :hook (caml-mode . ocaml-ts-mode))



(use-package python
  :ensure nil
  :hook
  (python-ts-mode . lim-lsp-ensure-for-eglot)
  (python-mode . python-ts-mode)
  :init (lim-treesit-enable 'python))

(use-package php-ts-mode
  :vc ( :url "https://github.com/emacs-php/php-ts-mode.git"
        :rev :newest)
  :hook
  (php-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'php))

(use-package typescript-ts-mode
  :ensure nil
  :hook
  (typescript-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'typescript))

(use-package typescript-mode
  :hook (typescript-mode . typescript-ts-mode))

(use-package tsx-ts-mode
  :ensure nil
  :hook
  (tsx-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'tsx))

;; (use-package tsx-mode
;;   :vc ( :url "https://github.com/orzechowskid/tsx-mode.el.git"
;;         :rev :newest)
;;   :hook (tsx-mode . tsx-ts-mode))
