lim-cn.org
*** Ruby

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package ruby-ts-mode
  :ensure nil
  :hook
  (ruby-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'ruby))

(use-package ruby-mode
  :ensure nil
  :hook (ruby-mode . ruby-ts-mode))

(use-package inf-ruby
  :hook
  (ruby-ts-mode-hook . inf-ruby-minor-mode)
  ;; Auto breakpoint
  (compilation-filter . inf-ruby-auto-enter)
  :init
  (setq inf-ruby-default-implementation "pry"))
#+end_src

*** Rust

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package rust-ts-mode
  :ensure nil
  :hook
  (rust-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'rust)
  :config
  (setq rust-ts-mode-indent-offset 4)

  (cl-defmethod eglot-initialization-options (server &context (major-mode rust-ts-mode))
    (lim-lsp-load-lsp-options "rust-analyzer")))

(use-package rust-mode
  :defer t
  :hook (rust-mode . rust-ts-mode)
  ;; :config
  ;; (setq rust-format-on-save t)
  )

(use-package rustic
  :defer t
  :hook (rustic-mode . rust-ts-mode)
  ;; :config
  ;; (setq rustic-lsp-client 'eglot)
  ;; (setq rustic-format-on-save t)
  )
#+end_src

*** SQL

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package sql
  :ensure nil
  :functions (lim/sql-ts-support)
  :hook (sql-mode . lim/sql-ts-support)
  :init
  (setq sql-mysql-options '("--protocol=tcp" "--prompt=" "--disable-pager"))
  
  (defun lim/sql-ts-support ()
    (treesit-parser-create 'sql)
    (treesit-major-mode-setup)))
#+end_src

*** VUE

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
;; (use-package vue-ts-mode
;;   :vc ( :url "https://github.com/8uff3r/vue-ts-mode.git"
;;         :rev :newest)
;;   :hook
;;   (vue-ts-mode . lim-lsp-ensure-for-eglot)
;;   :init (lim-treesit-enable vue))

(use-package vue-mode
  :hook
  (vue-ts-mode . lim-lsp-ensure-for-lsp-bridge)
  :init (lim-treesit-enable 'vue))
#+end_src

*** YAML

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package yaml-ts-mode
  :ensure nil
  :hook
  (yaml-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'yaml))

(use-package yaml-mode
  :hook (yaml-mode . yaml-ts-mode))
#+end_src

*** TOML

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes

#+end_src

*** Zig

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes

#+end_src

*** Web

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package emmet-mode
  :hook
  (sgml-mode . emmet-mode)
  (css-mode . emmet-mode))

(use-package web-mode
  :after (eglot emmet-mode)
  :hook
  (web-mode . lim-lsp-ensure-for-eglot)
  (web-mode . emmet-mode))
#+end_src

*** 安装所有的语法

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(use-package treesit
  :ensure nil
  :config
  (setq treesit-font-lock-level 4)

  (dolist (lang (mapcar #'car treesit-language-source-alist))
    (unless (treesit-language-available-p lang)
      (message "Install %s language grammer..." lang)
      (treesit-install-language-grammar lang))))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-dev.el :mkdirp yes
(provide 'lim-module-dev)
#+end_src

** lim-module-keybind.el 模块

*** 加载 lim-keymap 库

#+begin_src emacs-lisp :tangle module/lim-module-keybind.el :mkdirp yes
(use-package lim-keymap :ensure nil)
#+end_src

*** 加载 lim-hydra 库

自定义按键绑定(使用 ~hydra~ 完成)

#+begin_src emacs-lisp :tangle module/lim-module-keybind.el :mkdirp yes
(use-package lim-hydra
  :ensure nil
  :bind
  (("," . lim-hydra/body)
   :map isearch-mode-map
   ("," . lim-hydra/body)))
#+end_src

*** 加载 lim-minibuffer 库

#+begin_src emacs-lisp :tangle module/lim-module-keybind.el :mkdirp yes
(use-package lim-minibuffer
  :ensure nil
  :bind
  (:map minibuffer-mode-map
   ("," . lim-minibuffer-mode-enable))
  :hook
  (minibuffer-exit . lim-minibuffer-mode-disable))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-keybind.el :mkdirp yes
(provide 'lim-module-keybind)
#+end_src

** lim-module-input-method.el 模块

*** Rime 输入法(配置待完善)

配置待完善

PS: 使用系统的输入法 vs. 使用 =emacs= 中的输入法, 似乎二者是智者见智仁者见仁, 对于二者的优劣性个人认为还有待商榷, 等后期将系统输入法切换至 ~Rime~ 在补充配置信息

#+begin_src emacs-lisp :tangle module/lim-module-input-method.el :mkdirp yes
;; (use-package rime
;;   :config
;;   (setq default-input-method "rime")
;;   (setq rime-show-candidate 'minibuffer)
;;   (setq rime-user-data-dir (expand-file-name "librime/rime-ice" user-emacs-directory))
;;   (setq rime-emacs-module-header-root "/opt/homebrew/opt/emacs-plus@30/include")
;;   (setq rime-librime-root (expand-file-name "librime/dist" user-emacs-directory))
;;   :bind
;;   ( :map rime-mode-map
;;     ("C-," . 'rime-send-keybinding)))
#+end_src

*** 导出模块

#+begin_src emacs-lisp :tangle module/lim-module-input-method.el :mkdirp yes
(provide 'lim-module-input-method)
#+end_src

* Emacs 的自定义库

