module/lim-module-dev.el

(use-package ruby-ts-mode
  :ensure nil
  :hook
  (ruby-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'ruby))

(use-package ruby-mode
  :ensure nil
  :hook (ruby-mode . ruby-ts-mode))

(use-package inf-ruby
  :hook
  (ruby-ts-mode-hook . inf-ruby-minor-mode)
  ;; Auto breakpoint
  (compilation-filter . inf-ruby-auto-enter)
  :init
  (setq inf-ruby-default-implementation "pry"))

(use-package rust-ts-mode
  :ensure nil
  :hook
  (rust-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'rust)
  :config
  (setq rust-ts-mode-indent-offset 4)

  (cl-defmethod eglot-initialization-options (server &context (major-mode rust-ts-mode))
    (lim-lsp-load-lsp-options "rust-analyzer")))

(use-package rust-mode
  :defer t
  :hook (rust-mode . rust-ts-mode)
  ;; :config
  ;; (setq rust-format-on-save t)
  )

(use-package rustic
  :defer t
  :hook (rustic-mode . rust-ts-mode)
  ;; :config
  ;; (setq rustic-lsp-client 'eglot)
  ;; (setq rustic-format-on-save t)
  )

(use-package sql
  :ensure nil
  :functions (lim/sql-ts-support)
  :hook (sql-mode . lim/sql-ts-support)
  :init
  (setq sql-mysql-options '("--protocol=tcp" "--prompt=" "--disable-pager"))
  
  (defun lim/sql-ts-support ()
    (treesit-parser-create 'sql)
    (treesit-major-mode-setup)))

;; (use-package vue-ts-mode
;;   :vc ( :url "https://github.com/8uff3r/vue-ts-mode.git"
;;         :rev :newest)
;;   :hook
;;   (vue-ts-mode . lim-lsp-ensure-for-eglot)
;;   :init (lim-treesit-enable vue))

(use-package vue-mode
  :hook
  (vue-ts-mode . lim-lsp-ensure-for-lsp-bridge)
  :init (lim-treesit-enable 'vue))

(use-package yaml-ts-mode
  :ensure nil
  :hook
  (yaml-ts-mode . lim-lsp-ensure-for-eglot)
  :init (lim-treesit-enable 'yaml))

(use-package yaml-mode
  :hook (yaml-mode . yaml-ts-mode))





(use-package emmet-mode
  :hook
  (sgml-mode . emmet-mode)
  (css-mode . emmet-mode))

(use-package web-mode
  :after (eglot emmet-mode)
  :hook
  (web-mode . lim-lsp-ensure-for-eglot)
  (web-mode . emmet-mode))

(use-package treesit
  :ensure nil
  :config
  (setq treesit-font-lock-level 4)

  (dolist (lang (mapcar #'car treesit-language-source-alist))
    (unless (treesit-language-available-p lang)
      (message "Install %s language grammer..." lang)
      (treesit-install-language-grammar lang))))

(provide 'lim-module-dev)
