lim-cn.org
** lim-org.el 库

#+begin_src emacs-lisp :tangle feature/lim-org.el :mkdirp yes
;;; lim-org.el --- Lim's Customized Org -*- lexical-binding: t; coding: utf-8; -*-

;; Copyright (C) 2024 Tabuyos

;; Author: Tabuyos <tabuyos@outlook.com>
;; Maintainer: Tabuyos <tabuyos@outlook.com>
;; Created: 2024/05/20

;;; Commentary:

;; Org for Lim

;;; Code:

(declare-function org-html-export-as-html "org")

;;;###autoload
(defun lim-org-ox-html ()
  "Streamline HTML export."
  (interactive)
  (org-html-export-as-html nil nil nil t nil))

;;;###autoload
(defun lim-org-ox-texinfo ()
  "Streamline Info export."
  (interactive)
  (org-texinfo-export-to-info))

;;;; org-id

(declare-function org-entry-get "org")
(declare-function org-id-new "org")
(declare-function org-entry-put "org")

;; Original idea:
;; <https://writequit.org/articles/emacs-org-mode-generate-ids.html>.
(defun lim-org--id-get ()
  "Get the CUSTOM_ID of the current entry.
If the entry already has a CUSTOM_ID, return it as-is, else
create a new one."
  (let* ((pos (point))
         (id (org-entry-get pos "CUSTOM_ID")))
    (if (and id (stringp id) (string-match-p "\\S-" id))
        id
      (setq id (org-id-new "h"))
      (org-entry-put pos "CUSTOM_ID" id)
      id)))

(declare-function org-map-entries "org")

;;;###autoload
(defun lim-org-id-headlines ()
  "Add missing CUSTOM_ID to all headlines in current file."
  (interactive)
  (org-map-entries
   (lambda () (lim-org--id-get))))

;;;###autoload
(defun lim-org-id-headline ()
  "Add missing CUSTOM_ID to headline at point."
  (interactive)
  (lim-org--id-get))

(declare-function diary-sunrise-sunset "solar")

;; Sunrise
;;;###autoload
(defun lim-org-diary-sunrise ()
  (let ((dss (diary-sunrise-sunset)))
    (with-temp-buffer
      (insert dss)
      (goto-char (point-min))
      (while (re-search-forward " ([^)]*)" nil t)
        (replace-match "" nil nil))
      (goto-char (point-min))
      (search-forward ",")
      (buffer-substring (point-min) (match-beginning 0)))))

;; Sunset
;;;###autoload
(defun lim-org-diary-sunset ()
  (let ((dss (diary-sunrise-sunset))
        start end)
    (with-temp-buffer
      (insert dss)
      (goto-char (point-min))
      (while (re-search-forward " ([^)]*)" nil t)
        (replace-match "" nil nil))
      (goto-char (point-min))
      (search-forward ", ")
      (setq start (match-end 0))
      (search-forward " at")
      (setq end (match-beginning 0))
      (goto-char start)
      (capitalize-word 1)
      (buffer-substring start end))))

(provide 'lim-org)

;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:
#+end_src

** lim-search.el 库

#+begin_src emacs-lisp :tangle feature/lim-search.el :mkdirp yes
;;; lim-search.el --- Lim's Search Mode -*- lexical-binding: t; coding: utf-8; -*-

;; Copyright (C) 2024 Tabuyos

;; Author: Tabuyos <tabuyos@outlook.com>
;; Maintainer: Tabuyos <tabuyos@outlook.com>
;; Created: 2024/05/20

;;; Commentary:

;; Search for Lim

;;; Code:

(defvar lim-search-mode-quit-hook nil
  "Function(s) to call after terminating lim's search.")

(defun lim-search-dehighlight ()
  "Dehighlight search."
  (isearch-dehighlight)
  (lazy-highlight-cleanup t))

;;;###autoload
(defun lim-search-mode-quit ()
  "Disable `lim-search-mode'."
  (interactive)
  (lim-search-mode 0)
  (run-hooks 'lim-search-mode-quit-hook))

;;;###autoload
(defun lim-search-mode-toggle ()
  "Toggle `lim-search-mode'."
  (interactive)
  (lim-search-mode 'toggle))

(defvar-keymap lim-search-mode-map
  "p" #'isearch-repeat-backward
  "n" #'isearch-repeat-forward
  "<escape>" #'lim-search-mode-quit)

;;;###autoload
(define-minor-mode lim-search-mode
  "Lim's search mode."
  :init-value nil
  :global nil
  :lighter " Qs"
  :keymap lim-search-mode-map)

(provide 'lim-search)

;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:
#+end_src

