lim-cn.org
** lim-keymap.el 库

#+begin_src emacs-lisp :tangle feature/lim-keymap.el :mkdirp yes
;;; lim-keymap.el --- Lim's Keymap -*- lexical-binding: t; coding: utf-8; -*-

;; Copyright (C) 2024 Tabuyos

;; Author: Tabuyos <tabuyos@outlook.com>
;; Maintainer: Tabuyos <tabuyos@outlook.com>
;; Created: 2024/05/20

;;; Commentary:

;; Keymap for Lim

;;; Code:

(defun lim-keymap-get-keys (keymap)
  "Get keys of keymap."
  (let (keys)
    (map-keymap
     (lambda (key def)
       (cl-pushnew (key-description (vector key)) keys :test 'equal))
     (keymap-canonicalize keymap))
    keys))

(defun lim-keymap-get-bindings (keymap &optional prefix)
  "Get bindings of keymap."
  (let (bindings)
    (map-keymap
     (lambda (evt def)
       (let* ((key (vconcat prefix (list evt)))
              (key-desc (key-description key))
              (act-def (keymap-lookup keymap key-desc)))
         (cond (def
                (setf (alist-get key-desc bindings nil nil 'equal)
                      def))
               (t
                (when act-def
                  (setf (alist-get key-desc bindings nil nil 'equal)
                        act-def))))))
     (keymap-canonicalize keymap))
    bindings))

(provide 'lim-keymap)

;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:
#+end_src

** lim-minibuffer.el 库

#+begin_src emacs-lisp :tangle feature/lim-minibuffer.el :mkdirp yes
;;; lim-minibuffer.el --- Enhanced Minibuffer -*- lexical-binding: t; coding: utf-8; -*-

;; Copyright (C) 2024 Tabuyos

;; Author: Tabuyos <tabuyos@outlook.com>
;; Maintainer: Tabuyos <tabuyos@outlook.com>
;; Created: 2024/05/20

;;; Commentary:

;; Enhanced Minibuffer

;;; Code:

(require 'lim-hydra)

;;;###autoload
(defun lim-minibuffer-mode-enable ()
  "Enable `lim-minibuffer-mode'"
  (interactive)
  (lim-minibuffer-mode 1))

;;;###autoload
(defun lim-minibuffer-mode-disable ()
  "Disable `lim-minibuffer-mode'"
  (interactive)
  (lim-minibuffer-mode -1))

;;;###autoload
(defun lim-minibuffer-keyboard-quit ()
  "Keyboard Quit."
  (interactive)
  (minibuffer-keyboard-quit)
  (lim-minibuffer-mode-disable))

;;;###autoload
(defun lim-minibuffer-enter ()
  (interactive)
  (lim-hydra-enter)
  (lim-minibuffer-mode-disable))

;;;###autoload
(defun lim-minibuffer-insert-comma ()
  (interactive)
  (lim-simple-insert-comma)
  (lim-minibuffer-mode-disable))

(defvar lim-minibuffer-mode-map
  (let ((keymap (make-sparse-keymap)))
    (keymap-set keymap "," 'lim-minibuffer-insert-comma)
    (keymap-set keymap "n" 'lim-hydra-next-line)
    (keymap-set keymap "p" 'lim-hydra-prev-line)
    (keymap-set keymap "g" 'lim-minibuffer-keyboard-quit)
    (keymap-set keymap "SPC" 'lim-minibuffer-mode-disable)
    keymap))

;;;###autoload
(define-minor-mode lim-minibuffer-mode
  "Enhanced Minibuffer Navigate."
  :init-value nil
  :global nil
  :lighter nil
  :keymap lim-minibuffer-mode-map)

(provide 'lim-minibuffer)

;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:
#+end_src

** lim-dev.el 库

#+begin_src emacs-lisp :tangle feature/lim-dev.el :mkdirp yes
;;; lim-dev.el --- Lim's Dev Language -*- lexical-binding: t; coding: utf-8; -*-

;; Copyright (C) 2024 Tabuyos

;; Author: Tabuyos <tabuyos@outlook.com>
;; Maintainer: Tabuyos <tabuyos@outlook.com>
;; Created: 2024/05/20

;;; Commentary:

;; Dev Language for Lim

;;; Code:

(defvar lim-dev-go-tools-alist nil "Tools for Golang.")

(defun lim-dev-install-go-tools (&optional tools update)
  "Install or update go tools."
  (interactive
   (list lim-dev-go-tools-alist
         (< 1 (prefix-numeric-value current-prefix-arg))))
  (unless (executable-find "go")
    (user-error "Unable to find `go' in `exec-path'!"))

  (dolist (tool tools)
    (let ((pkg (symbol-name (car-safe tool)))
          (url (cdr-safe tool)))
      (when (or update (not (executable-find pkg)))
        (set-process-sentinel
         (start-process
          "go-tools" nil
          "go" "install" "-v" "-x" (concat url "@latest"))
         `(lambda (proc _)
            (let ((status (process-exit-status proc)))
              (if (= 0 status)
                  (message "Installed %s" ,pkg)
                (message "Failed to install %s: %d" ,pkg status)))
            ))))))

(provide 'lim-dev)

;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:
#+end_src

